zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
/**
  ******************************************************************************
  * @file    stm32wb07_06_types.h
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef _STM32WB07_06_TYPES_H_
#define _STM32WB07_06_TYPES_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "compiler.h"
#include "ble_const.h"
#include "ble_types.h"
#include "stm32wb07_06_conf.h"

typedef uint8_t ble_status_t;

#include <stdint.h>
typedef ble_status_t (*hci_event_process)(uint8_t *buffer_in);
typedef struct hci_command_table_type_s
{
  uint16_t evt_code;
  hci_event_process process;
} hci_events_table_type_t, hci_le_meta_events_table_type_t, hci_vendor_specific_events_table_type_t;

extern const hci_events_table_type_t hci_events_table[8];
extern const hci_le_meta_events_table_type_t hci_le_meta_events_table[25];
extern const hci_vendor_specific_events_table_type_t hci_vendor_specific_events_table[46];
#include <stdint.h>

/** Documentation for C struct advertising_set_parameters_t */
typedef PACKED(struct) packed_Advertising_Set_Parameters_t_s
{
  /** It is used to identify an advertising set.
    *  Values:
    *  - 0x00 ... 0xEF
    */
  uint8_t advertising_handle;
  /** The duration[i] parameter indicates the duration for which that advertising set
    *  is enabled. The duration begins at the start of the first advertising
    *  event of this advertising set. The Controller should not start an extended
    *  advertising event that it cannot complete within the duration. Time = N *
    *  10 ms 0x00 means no advertising duration: advertising will continue until
    *  the Host disables it.
    *  Values:
    *  - 0x0000 (0 ms) : No advertising duration
    *  - 0x0001 (10 ms)  ... 0xFFFF (655350 ms)
    */
  uint16_t duration;
  /** The max_extended_advertising_events[i] parameter, if non-zero, indicates the
    *  maximum number of extended advertising events that shall be sent prior to
    *  disabling the extended advertising set even if the duration[i] parameter
    *  has not expired.
    *  Values:
    *  - 0x00: No maximum number of advertising events.
    *  - 0x01 ... 0xFF: Maximum number of extended advertising events.
    */
  uint8_t max_extended_advertising_events;
} packed_advertising_set_parameters_t;
/** Documentation for C struct extended_scan_parameters_t */
typedef PACKED(struct) packed_Extended_Scan_Parameters_t_s
{
  /** The scan_type parameter specifies the type of scan to perform. 0: Passive
    *  Scanning. No scan request PDUs shall be sent. 1: Active Scanning. Scan
    *  request PDUs may be sent.
    *  Values:
    *  - 0x00: Passive Scanning
    *  - 0x01: Active Scanning
    */
  uint8_t scan_type;
  /** Time interval from when the Controller started its last scan until it begins the
    *  subsequent scan on the primary advertising channel.  Time = N * 0.625 ms
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_interval;
  /** Duration of the scan on the primary advertising channel.  Time = N * 0.625 ms
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_window;
} packed_extended_scan_parameters_t;
/** Documentation for C struct extended_create_connection_parameters_t */
typedef PACKED(struct) packed_Extended_Create_Connection_Parameters_t_s
{
  /** Time interval from when the Controller started its last scan until it begins the
    *  subsequent scan on the primary advertising channel. Time = N * 0.625 ms;
    *  Time Range: 2.5 ms to 40.959375 s.
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_interval;
  /** Duration of the scan on the primary advertising channel. Time = N * 0.625 ms;
    *  Time Range: 2.5 ms to 40.959375 s.
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_window;
  /** Minimum value for the connection interval. This shall be less than or equal to
    *  conn_interval_max[i]. Time = N * 1.25 ms; Time Range: 7.5 ms to 4 s.
    *  Values:
    *  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
    */
  uint16_t conn_interval_min;
  /** Maximum value for the connection interval. This shall be less than or equal to
    *  conn_interval_max[i]. Time = N * 1.25 ms; Time Range: 7.5 ms to 4 s.
    *  Values:
    *  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
    */
  uint16_t conn_interval_max;
  /** Slave latency for the connection in number of connection events
    *  Values:
    *  - 0x0000 ... 0x01F3
    */
  uint16_t conn_latency;
  /** Supervision timeout for the LE Link. (See [Vol 6] Part B, Section 4.5.2) Time =
    *  N * 10 ms; Time Range: 100 ms to 32 s.
    *  Values:
    *  - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
    */
  uint16_t supervision_timeout;
  /** Informative parameter recommending the minimum length of connection event needed
    *  for this LE connection. Time = N * 0.625 ms.
    *  Values:
    *  - 0x0000 (0.000 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t minimum_ce_length;
  /** Informative parameter recommending the maximum length of connection event needed
    *  for this LE connection. Time = N * 0.625 ms.
    *  Values:
    *  - 0x0000 (0.000 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t maximum_ce_length;
} packed_extended_create_conn_param_t;
/** Documentation for C struct bonded_device_entry_t */
typedef PACKED(struct) packed_bonded_device_entry_t_s
{
  /** Address type.
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    */
  uint8_t address_type;
  /** Identity Address (Public or Random) of the device.
   */
  uint8_t address[6];
} packed_bonded_device_entry_t;
