zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
/** Documentation for C struct list_entry_t */
typedef PACKED(struct) packed_list_entry_t_s
{
  /** Address type.
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    */
  uint8_t peer_address_type;
  /** Public Device Address or Random Device Address of the device to be added to the
    *  list.
    */
  uint8_t peer_address[6];
} packed_list_entry_t;
/** Documentation for C union service_uuid_t */
typedef PACKED(union) packed_service_uuid_t_s
{
  /** 16-bit UUID
   */
  uint16_t service_uuid_16;
  /** 128-bit UUID
   */
  uint8_t service_uuid_128[16];
} packed_service_uuid_t;
/** Documentation for C union char_uuid_t */
typedef PACKED(union) packed_char_uuid_t_s
{
  /** 16-bit UUID
   */
  uint16_t char_uuid_16;
  /** 128-bit UUID
   */
  uint8_t char_uuid_128[16];
} packed_char_uuid_t;
/** Documentation for C union char_desc_uuid_t */
typedef PACKED(union) packed_char_desc_uuid_t_s
{
  /** 16-bit UUID
   */
  uint16_t char_uuid_16;
  /** 128-bit UUID
   */
  uint8_t char_uuid_128[16];
} packed_char_desc_uuid_t;
/** Documentation for C union uuid_t */
typedef PACKED(union) packed_uuid_t_s
{
  /** 16-bit UUID
   */
  uint16_t uuid_16;
  /** 128-bit UUID
   */
  uint8_t uuid_128[16];
} packed_uuid_t;
/** Documentation for C struct handle_entry_t */
typedef PACKED(struct) packed_handle_entry_t_s
{
  /** The handles for which the attribute value has to be read
    *  Values:
    *  - 0x0001 ... 0xFFFF
    */
  uint16_t handle;
} packed_handle_entry_t;
/** Documentation for C struct handle_packets_pair_entry_t */
typedef PACKED(struct) packed_handle_packets_pair_entry_t_s
{
  /** Connection handle
   */
  uint16_t connection_handle;
  /** The number of HCI Data Packets that have been completed (transmitted or flushed)
    *  for the associated connection_handle since the previous time the event was
    *  returned.
    */
  uint16_t hc_num_of_completed_packets;
} packed_handle_packets_pair_entry_t;
/** Documentation for C struct attribute_group_handle_pair_t */
typedef PACKED(struct) packed_attribute_group_handle_pair_t_s
{
  /** Found Attribute handle
   */
  uint16_t found_attribute_handle;
  /** Group End handle
   */
  uint16_t group_end_handle;
} packed_attribute_group_handle_pair_t;
/** Documentation for C struct advertising_report_t */
typedef PACKED(struct) packed_advertising_report_t_s
{
  /** Type of advertising report event: ADV_IND: Connectable undirected advertising',
    *  ADV_DIRECT_IND: Connectable directed advertising, ADV_SCAN_IND: Scannable
    *  undirected advertising, ADV_NONCONN_IND: Non connectable undirected
    *  advertising, SCAN_RSP: Scan response.
    *  Values:
    *  - 0x00: ADV_IND
    *  - 0x01: ADV_DIRECT_IND
    *  - 0x02: ADV_SCAN_IND
    *  - 0x03: ADV_NONCONN_IND
    *  - 0x04: SCAN_RSP
    */
  uint8_t event_type;
  /** 0x00 Public Device Address 0x01 Random Device Address 0x02 Public Identity
    *  Address (Corresponds to Resolved Private Address) 0x03 Random (Static)
    *  Identity Address (Corresponds to Resolved Private Address)
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address
    *  - 0x03: Random (Static) Identity Address
    */
  uint8_t address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the advertising device.
    */
  uint8_t address[6];
  /** Length of the Data[i] field for each device which responded.
    *  Values:
    *  - 0 ... 31
    */
  uint8_t data_length;
  /** data_length octets of advertising or scan response data formatted as defined in
    *  [Vol 3] Part C, Section 8.
    */
  uint8_t data[1];
  /** N Size: 1 Octet (signed integer) Units: dBm
    *  Values:
    *  - -127 ... 20
    *  - 127: RSSI not available
    */
  int8_t rssi;
} packed_advertising_report_t;
/** Documentation for C struct direct_advertising_report_t */
typedef PACKED(struct) packed_Direct_Advertising_Report_t_s
{
  /** Advertising type
    *  Values:
    *  - 0x01: Connectable directed advertising (ADV_DIRECT_IND)
    */
  uint8_t event_type;
  /** 0x00 Public Device Address 0x01 Random Device Address 0x02 Public Identity
    *  Address (Corresponds to Resolved Private Address) 0x03 Random (Static)
    *  Identity Address (Corresponds to Resolved Private Address)
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address
    *  - 0x03: Random (Static) Identity Address
    */
  uint8_t address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the advertising device.
    */
  uint8_t address[6];
  /** 0x01 Random Device Address
    *  Values:
    *  - 0x01: Random Device Address
    */
  uint8_t direct_address_type;
  /** Random Device Address
   */
  uint8_t direct_address[6];
  /** N Size: 1 Octet (signed integer) Units: dBm
    *  Values:
    *  - -127 ... 20
    *  - 127: RSSI not available
    */
  int8_t rssi;
} packed_direct_advertising_report_t;
/** Documentation for C struct extended_advertising_report_t */
typedef PACKED(struct) packed_Extended_Advertising_Report_t_s
{
  /** Event Type parameter. Bits from 0 to 4: 0 Connectable advertising 1 Scannable
    *  advertising 2 Directed advertising 3 Scan response 4 Legacy advertising
    *  PDUs used Bits 5-6 Data status: 00b = Complete 01b = Incomplete, more data
    *  to come 10b = Incomplete, data truncated, no more to come 11b = Reserved
    *  for future use
    *  Flags:
    *  - 0x0001: Connectable advertising
    *  - 0x0002: Scannable advertising
    *  - 0x0004: Directed advertising
    *  - 0x0008: Scan response
    *  - 0x0010: Legacy advertising PDUs used
    */
  uint16_t event_type;
  /** Address Type
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address (corresponds to Resolved Private Address)
    *  - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
    *  - 0xFF: No address provided (anonymous advertisement)
    */
  uint8_t address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the advertising device.
    */
  uint8_t address[6];
  /** PHY used to send the advertising PDU on the primary advertising physical
    *  channel.
    *  Values:
    *  - 0x01: LE_1M_PHY
    *  - 0x03: LE_CODED_PHY
    */
  uint8_t primary_phy;
  /** This parameter indicates the PHY used to send the advertising PDU(s), if any, on
    *  the secondary advertising physical channel.
    *  Values:
    *  - 0x00: No packets
    *  - 0x01: LE_1M_PHY
    *  - 0x02: LE_2M_PHY
    *  - 0x03: LE_CODED_PHY
    */
  uint8_t secondary_phy;
  /** Advertising SID subfield in the ADI field of the PDU
    *  Values:
    *  - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
    *  - 0xFF: No ADI field in the PDU
    */
  uint8_t advertising_sid;
  /** Tx Power. Units: dBm.
    *  Values:
    *  - -127 ... 126
    *  - 127: NA
    */
  int8_t tx_power;
  /** RSSI value; Units: dBm; All other values Reserved for future use.
    *  Values:
    *  - -127 ... 20
    *  - 127: NA
    */
  int8_t rssi;
  /** Interval of the periodic advertising. Time = N * 1.25 ms; Time Range: 7.5 ms to
    *  81,918.75 s.
    *  Values:
    *  - 0x0000 (NaN) : No periodic advertising
    *  - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Interval of the periodic advertising
    */
  uint16_t periodic_advertising_interval;
  /** Direct address type
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address (Corresponds to Resolved Private Address)
    *  - 0x03: Random (static) Identity Address (Corresponds to Resolved Private Address)
    *  - 0x04 ... 0xFD: Reserved for future use
    *  - 0xFE: Random Device Address (Controller unable to resolve)
    *  - 0xFF: Reserved for future use
    */
  uint8_t direct_address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the target device
    */
  uint8_t direct_address[6];
  /** Length of the Data[i] field for each device which responded
    *  Values:
    *  - 0 ... 229: Length of the Data[i] field for each device which responded
    *  - 229 ... 255: Reserved for future use
    */
  uint8_t data_length;
  /** data_length[i] octets of advertising or scan response data formatted as defined
    *  in [Vol 3] Part C, Section 11. Note: Each element of this array has a
    *  variable length.
    */
  uint8_t data[1];
} packed_extended_advertising_report_t;
/** Documentation for C struct samples_t */
typedef PACKED(struct) packed_samples_t_s
{
  /** The list of I samples for the reported packet. Each sample is a signed integer.
    *  The list is in the order of the sampling points within the packet.
    */
  int8_t i_sample;
  /** The list of Q samples for the reported packet. Each sample is a signed integer.
    *  The list is in the order of the sampling points within the packet.
    */
  int8_t q_sample;
} packed_samples_t;
