zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) hci_disconnect_cp0_s
{
  uint16_t connection_handle;
  uint8_t reason;
} hci_disconnect_cp0;

typedef PACKED(struct) hci_disconnect_rp0_s
{
  uint8_t status;
} hci_disconnect_rp0;

typedef PACKED(struct) hci_read_remote_version_information_cp0_s
{
  uint16_t connection_handle;
} hci_read_remote_version_information_cp0;

typedef PACKED(struct) hci_read_remote_version_information_rp0_s
{
  uint8_t status;
} hci_read_remote_version_information_rp0;

typedef PACKED(struct) hci_set_event_mask_cp0_s
{
  uint8_t event_mask[8];
} hci_set_event_mask_cp0;

typedef PACKED(struct) hci_set_event_mask_rp0_s
{
  uint8_t status;
} hci_set_event_mask_rp0;

typedef PACKED(struct) hci_reset_rp0_s
{
  uint8_t status;
} hci_reset_rp0;

typedef PACKED(struct) hci_read_transmit_power_level_cp0_s
{
  uint16_t connection_handle;
  uint8_t type;
} hci_read_transmit_power_level_cp0;

typedef PACKED(struct) hci_read_transmit_power_level_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  int8_t transmit_power_level;
} hci_read_transmit_power_level_rp0;

typedef PACKED(struct) hci_set_event_mask_page_2_cp0_s
{
  uint8_t event_mask_page_2[8];
} hci_set_event_mask_page_2_cp0;

typedef PACKED(struct) hci_set_event_mask_page_2_rp0_s
{
  uint8_t status;
} hci_set_event_mask_page_2_rp0;

typedef PACKED(struct) hci_read_authenticated_payload_timeout_cp0_s
{
  uint16_t connection_handle;
} hci_read_authenticated_payload_timeout_cp0;

typedef PACKED(struct) hci_read_authenticated_payload_timeout_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint16_t authenticated_payload_timeout;
} hci_read_authenticated_payload_timeout_rp0;

typedef PACKED(struct) hci_write_authenticated_payload_timeout_cp0_s
{
  uint16_t connection_handle;
  uint16_t authenticated_payload_timeout;
} hci_write_authenticated_payload_timeout_cp0;

typedef PACKED(struct) hci_write_authenticated_payload_timeout_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_write_authenticated_payload_timeout_rp0;

typedef PACKED(struct) hci_read_local_version_information_rp0_s
{
  uint8_t status;
  uint8_t hci_version;
  uint16_t hci_revision;
  uint8_t lmp_pal_version;
  uint16_t manufacturer_name;
  uint16_t lmp_pal_subversion;
} hci_read_local_version_information_rp0;

typedef PACKED(struct) hci_read_local_supported_commands_rp0_s
{
  uint8_t status;
  uint8_t supported_commands[64];
} hci_read_local_supported_commands_rp0;

typedef PACKED(struct) hci_read_local_supported_features_rp0_s
{
  uint8_t status;
  uint8_t lmp_features[8];
} hci_read_local_supported_features_rp0;

typedef PACKED(struct) hci_read_bd_addr_rp0_s
{
  uint8_t status;
  uint8_t bd_addr[6];
} hci_read_bd_addr_rp0;

typedef PACKED(struct) hci_read_rssi_cp0_s
{
  uint16_t connection_handle;
} hci_read_rssi_cp0;

typedef PACKED(struct) hci_read_rssi_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  int8_t rssi;
} hci_read_rssi_rp0;

typedef PACKED(struct) hci_le_set_event_mask_cp0_s
{
  uint8_t le_event_mask[8];
} hci_le_set_event_mask_cp0;

typedef PACKED(struct) hci_le_set_event_mask_rp0_s
{
  uint8_t status;
} hci_le_set_event_mask_rp0;

typedef PACKED(struct) hci_le_read_buffer_size_rp0_s
{
  uint8_t status;
  uint16_t hc_le_acl_data_packet_length;
  uint8_t hc_total_num_le_acl_data_lackets;
} hci_le_read_buffer_size_rp0;

typedef PACKED(struct) hci_le_read_local_supported_features_rp0_s
{
  uint8_t status;
  uint8_t le_features[8];
} hci_le_read_local_supported_features_rp0;

typedef PACKED(struct) hci_le_set_random_address_cp0_s
{
  uint8_t random_address[6];
} hci_le_set_random_address_cp0;

typedef PACKED(struct) hci_le_set_random_address_rp0_s
{
  uint8_t status;
} hci_le_set_random_address_rp0;

typedef PACKED(struct) hci_le_set_advertising_parameters_cp0_s
{
  uint16_t advertising_interval_min;
  uint16_t advertising_interval_max;
  uint8_t advertising_type;
  uint8_t own_address_type;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
  uint8_t advertising_channel_map;
  uint8_t advertising_filter_policy;
} hci_le_set_advertising_parameters_cp0;

typedef PACKED(struct) hci_le_set_advertising_parameters_rp0_s
{
  uint8_t status;
} hci_le_set_advertising_parameters_rp0;

typedef PACKED(struct) hci_le_read_advertising_channel_tx_power_rp0_s
{
  uint8_t status;
  int8_t transmit_power_level;
} hci_le_read_advertising_channel_tx_power_rp0;

typedef PACKED(struct) hci_le_set_advertising_data_cp0_s
{
  uint8_t advertising_data_length;
  uint8_t advertising_data[31];
} hci_le_set_advertising_data_cp0;

typedef PACKED(struct) hci_le_set_advertising_data_rp0_s
{
  uint8_t status;
} hci_le_set_advertising_data_rp0;

typedef PACKED(struct) hci_le_set_scan_response_data_cp0_s
{
  uint8_t scan_response_data_length;
  uint8_t scan_response_data[31];
} hci_le_set_scan_response_data_cp0;

typedef PACKED(struct) hci_le_set_scan_response_data_rp0_s
{
  uint8_t status;
} hci_le_set_scan_response_data_rp0;

typedef PACKED(struct) hci_le_set_advertising_enable_cp0_s
{
  uint8_t advertising_enable;
} hci_le_set_advertising_enable_cp0;

typedef PACKED(struct) hci_le_set_advertising_enable_rp0_s
{
  uint8_t status;
} hci_le_set_advertising_enable_rp0;

typedef PACKED(struct) hci_le_set_scan_parameters_cp0_s
{
  uint8_t le_scan_type;
  uint16_t le_scan_interval;
  uint16_t le_scan_window;
  uint8_t own_address_type;
  uint8_t scanning_filter_policy;
} hci_le_set_scan_parameters_cp0;

typedef PACKED(struct) hci_le_set_scan_parameters_rp0_s
{
  uint8_t status;
} hci_le_set_scan_parameters_rp0;

typedef PACKED(struct) hci_le_set_scan_enable_cp0_s
{
  uint8_t le_scan_enable;
  uint8_t filter_duplicates;
} hci_le_set_scan_enable_cp0;

typedef PACKED(struct) hci_le_set_scan_enable_rp0_s
{
  uint8_t status;
} hci_le_set_scan_enable_rp0;

typedef PACKED(struct) hci_le_create_connection_cp0_s
{
  uint16_t le_scan_interval;
  uint16_t le_scan_window;
  uint8_t initiator_filter_policy;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
  uint8_t own_address_type;
  uint16_t conn_interval_min;
  uint16_t conn_interval_max;
  uint16_t conn_latency;
  uint16_t supervision_timeout;
  uint16_t minimum_ce_length;
  uint16_t maximum_ce_length;
} hci_le_create_connection_cp0;

