zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) hci_le_remove_device_from_resolving_list_rp0_s
{
  uint8_t status;
} hci_le_remove_device_from_resolving_list_rp0;

typedef PACKED(struct) hci_le_clear_resolving_list_rp0_s
{
  uint8_t status;
} hci_le_clear_resolving_list_rp0;

typedef PACKED(struct) hci_le_read_resolving_list_size_rp0_s
{
  uint8_t status;
  uint8_t resolving_list_size;
} hci_le_read_resolving_list_size_rp0;

typedef PACKED(struct) hci_le_read_peer_resolvable_address_cp0_s
{
  uint8_t peer_identity_address_type;
  uint8_t peer_identity_address[6];
} hci_le_read_peer_resolvable_address_cp0;

typedef PACKED(struct) hci_le_read_peer_resolvable_address_rp0_s
{
  uint8_t status;
  uint8_t peer_resolvable_address[6];
} hci_le_read_peer_resolvable_address_rp0;

typedef PACKED(struct) hci_le_read_local_resolvable_address_cp0_s
{
  uint8_t peer_identity_address_type;
  uint8_t peer_identity_address[6];
} hci_le_read_local_resolvable_address_cp0;

typedef PACKED(struct) hci_le_read_local_resolvable_address_rp0_s
{
  uint8_t status;
  uint8_t local_resolvable_address[6];
} hci_le_read_local_resolvable_address_rp0;

typedef PACKED(struct) hci_le_set_address_resolution_enable_cp0_s
{
  uint8_t address_resolution_enable;
} hci_le_set_address_resolution_enable_cp0;

typedef PACKED(struct) hci_le_set_address_resolution_enable_rp0_s
{
  uint8_t status;
} hci_le_set_address_resolution_enable_rp0;

typedef PACKED(struct) hci_le_set_resolvable_private_address_timeout_cp0_s
{
  uint16_t rpa_timeout;
} hci_le_set_resolvable_private_address_timeout_cp0;

typedef PACKED(struct) hci_le_set_resolvable_private_address_timeout_rp0_s
{
  uint8_t status;
} hci_le_set_resolvable_private_address_timeout_rp0;

typedef PACKED(struct) hci_le_read_maximum_data_length_rp0_s
{
  uint8_t status;
  uint16_t supported_max_tx_octets;
  uint16_t supported_max_tx_time;
  uint16_t supported_max_rx_octets;
  uint16_t supported_max_rx_time;
} hci_le_read_maximum_data_length_rp0;

typedef PACKED(struct) hci_le_read_phy_cp0_s
{
  uint16_t connection_handle;
} hci_le_read_phy_cp0;

typedef PACKED(struct) hci_le_read_phy_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t tx_phy;
  uint8_t rx_phy;
} hci_le_read_phy_rp0;

typedef PACKED(struct) hci_le_set_default_phy_cp0_s
{
  uint8_t all_phys;
  uint8_t tx_phys;
  uint8_t rx_phys;
} hci_le_set_default_phy_cp0;

typedef PACKED(struct) hci_le_set_default_phy_rp0_s
{
  uint8_t status;
} hci_le_set_default_phy_rp0;

typedef PACKED(struct) hci_le_set_phy_cp0_s
{
  uint16_t connection_handle;
  uint8_t all_phys;
  uint8_t tx_phys;
  uint8_t rx_phys;
  uint16_t phy_options;
} hci_le_set_phy_cp0;

typedef PACKED(struct) hci_le_set_phy_rp0_s
{
  uint8_t status;
} hci_le_set_phy_rp0;

typedef PACKED(struct) hci_le_enhanced_receiver_test_cp0_s
{
  uint8_t rx_channel;
  uint8_t phy;
  uint8_t modulation_index;
} hci_le_enhanced_receiver_test_cp0;

typedef PACKED(struct) hci_le_enhanced_receiver_test_rp0_s
{
  uint8_t status;
} hci_le_enhanced_receiver_test_rp0;

typedef PACKED(struct) hci_le_enhanced_transmitter_test_cp0_s
{
  uint8_t tx_channel;
  uint8_t length_of_test_data;
  uint8_t packet_payload;
  uint8_t phy;
} hci_le_enhanced_transmitter_test_cp0;

typedef PACKED(struct) hci_le_enhanced_transmitter_test_rp0_s
{
  uint8_t status;
} hci_le_enhanced_transmitter_test_rp0;

typedef PACKED(struct) hci_le_set_advertising_set_random_address_cp0_s
{
  uint8_t advertising_handle;
  uint8_t advertising_random_address[6];
} hci_le_set_advertising_set_random_address_cp0;

typedef PACKED(struct) hci_le_set_advertising_set_random_address_rp0_s
{
  uint8_t status;
} hci_le_set_advertising_set_random_address_rp0;

typedef PACKED(struct) hci_le_set_extended_advertising_parameters_cp0_s
{
  uint8_t advertising_handle;
  uint16_t advertising_event_properties;
  uint8_t primary_advertising_interval_min[3];
  uint8_t primary_advertising_interval_max[3];
  uint8_t primary_advertising_channel_map;
  uint8_t own_address_type;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
  uint8_t advertising_filter_policy;
  int8_t advertising_tx_power;
  uint8_t primary_advertising_phy;
  uint8_t secondary_advertising_max_skip;
  uint8_t secondary_advertising_phy;
  uint8_t advertising_sid;
  uint8_t scan_request_notification_enable;
} hci_le_set_extended_advertising_parameters_cp0;

typedef PACKED(struct) hci_le_set_extended_advertising_parameters_rp0_s
{
  uint8_t status;
  int8_t selected_tx_power;
} hci_le_set_extended_advertising_parameters_rp0;

typedef PACKED(struct) hci_le_set_extended_advertising_data_cp0_s
{
  uint8_t advertising_handle;
  uint8_t operation;
  uint8_t fragment_preference;
  uint8_t advertising_data_length;
  uint8_t advertising_data[(HCI_MAX_PAYLOAD_SIZE - 4) / sizeof(uint8_t)];
} hci_le_set_extended_advertising_data_cp0;

typedef PACKED(struct) hci_le_set_extended_advertising_data_rp0_s
{
  uint8_t status;
} hci_le_set_extended_advertising_data_rp0;

typedef PACKED(struct) hci_le_set_extended_scan_response_data_cp0_s
{
  uint8_t advertising_handle;
  uint8_t operation;
  uint8_t fragment_preference;
  uint8_t scan_response_data_length;
  uint8_t scan_response_data[(HCI_MAX_PAYLOAD_SIZE - 4) / sizeof(uint8_t)];
} hci_le_set_extended_scan_response_data_cp0;

typedef PACKED(struct) hci_le_set_extended_scan_response_data_rp0_s
{
  uint8_t status;
} hci_le_set_extended_scan_response_data_rp0;

typedef PACKED(struct) hci_le_set_extended_advertising_enable_cp0_s
{
  uint8_t enable;
  uint8_t number_of_sets;
  packed_advertising_set_parameters_t advertising_set_parameters[(HCI_MAX_PAYLOAD_SIZE - 2) /
                                                                 sizeof(packed_advertising_set_parameters_t)];
} hci_le_set_extended_advertising_enable_cp0;

typedef PACKED(struct) hci_le_set_extended_advertising_enable_rp0_s
{
  uint8_t status;
} hci_le_set_extended_advertising_enable_rp0;

typedef PACKED(struct) hci_le_read_maximum_advertising_data_length_rp0_s
{
  uint8_t status;
  uint16_t maximum_advertising_data_length;
} hci_le_read_maximum_advertising_data_length_rp0;

typedef PACKED(struct) hci_le_read_number_of_supported_advertising_sets_rp0_s
{
  uint8_t status;
  uint8_t num_supported_advertising_sets;
} hci_le_read_number_of_supported_advertising_sets_rp0;

typedef PACKED(struct) hci_le_remove_advertising_set_cp0_s
{
  uint8_t advertising_handle;
} hci_le_remove_advertising_set_cp0;

typedef PACKED(struct) hci_le_remove_advertising_set_rp0_s
{
  uint8_t status;
} hci_le_remove_advertising_set_rp0;

typedef PACKED(struct) hci_le_clear_advertising_sets_rp0_s
{
  uint8_t status;
} hci_le_clear_advertising_sets_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_parameters_cp0_s
{
  uint8_t advertising_handle;
  uint16_t periodic_advertising_interval_min;
  uint16_t periodic_advertising_interval_max;
  uint16_t periodic_advertising_properties;
} hci_le_set_periodic_advertising_parameters_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_parameters_rp0_s
{
  uint8_t status;
} hci_le_set_periodic_advertising_parameters_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_data_cp0_s
{
  uint8_t advertising_handle;
  uint8_t operation;
  uint8_t advertising_data_length;
  uint8_t advertising_data[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(uint8_t)];
} hci_le_set_periodic_advertising_data_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_data_rp0_s
{
  uint8_t status;
} hci_le_set_periodic_advertising_data_rp0;

