zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) hci_le_set_periodic_advertising_enable_cp0_s
{
  uint8_t enable;
  uint8_t advertising_handle;
} hci_le_set_periodic_advertising_enable_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_enable_rp0_s
{
  uint8_t status;
} hci_le_set_periodic_advertising_enable_rp0;

typedef PACKED(struct) hci_le_set_extended_scan_parameters_cp0_s
{
  uint8_t own_address_type;
  uint8_t scanning_filter_policy;
  uint8_t scanning_phys;
  packed_extended_scan_parameters_t extended_scan_parameters[(HCI_MAX_PAYLOAD_SIZE - 3) /
                                                             sizeof(packed_extended_scan_parameters_t)];
} hci_le_set_extended_scan_parameters_cp0;

typedef PACKED(struct) hci_le_set_extended_scan_parameters_rp0_s
{
  uint8_t status;
} hci_le_set_extended_scan_parameters_rp0;

typedef PACKED(struct) hci_le_set_extended_scan_enable_cp0_s
{
  uint8_t enable;
  uint8_t filter_duplicates;
  uint16_t duration;
  uint16_t period;
} hci_le_set_extended_scan_enable_cp0;

typedef PACKED(struct) hci_le_set_extended_scan_enable_rp0_s
{
  uint8_t status;
} hci_le_set_extended_scan_enable_rp0;

typedef PACKED(struct) hci_le_extended_create_connection_cp0_s
{
  uint8_t initiating_filter_policy;
  uint8_t own_address_type;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
  uint8_t initiating_phys;
  packed_extended_create_conn_param_t ext_create_conn_param[(HCI_MAX_PAYLOAD_SIZE - 10) /
                                                            sizeof(packed_extended_create_conn_param_t)];
} hci_le_extended_create_connection_cp0;

typedef PACKED(struct) hci_le_extended_create_connection_rp0_s
{
  uint8_t status;
} hci_le_extended_create_connection_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_create_sync_cp0_s
{
  uint8_t options;
  uint8_t advertising_sid;
  uint8_t advertising_address_type;
  uint8_t advertising_address[6];
  uint16_t skip;
  uint16_t sync_timeout;
  uint8_t sync_cte_type;
} hci_le_periodic_advertising_create_sync_cp0;

typedef PACKED(struct) hci_le_periodic_advertising_create_sync_rp0_s
{
  uint8_t status;
} hci_le_periodic_advertising_create_sync_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_create_sync_cancel_rp0_s
{
  uint8_t status;
} hci_le_periodic_advertising_create_sync_cancel_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_terminate_sync_cp0_s
{
  uint16_t sync_handle;
} hci_le_periodic_advertising_terminate_sync_cp0;

typedef PACKED(struct) hci_le_periodic_advertising_terminate_sync_rp0_s
{
  uint8_t status;
} hci_le_periodic_advertising_terminate_sync_rp0;

typedef PACKED(struct) hci_le_add_device_to_periodic_advertiser_list_cp0_s
{
  uint8_t advertiser_address_type;
  uint8_t advertising_address[6];
  uint8_t advertising_sid;
} hci_le_add_device_to_periodic_advertiser_list_cp0;

typedef PACKED(struct) hci_le_add_device_to_periodic_advertiser_list_rp0_s
{
  uint8_t status;
} hci_le_add_device_to_periodic_advertiser_list_rp0;

typedef PACKED(struct) hci_le_remove_device_from_periodic_advertising_list_cp0_s
{
  uint8_t advertiser_address_type;
  uint8_t advertising_address[6];
  uint8_t advertising_sid;
} hci_le_remove_device_from_periodic_advertising_list_cp0;

typedef PACKED(struct) hci_le_remove_device_from_periodic_advertising_list_rp0_s
{
  uint8_t status;
} hci_le_remove_device_from_periodic_advertising_list_rp0;

typedef PACKED(struct) hci_le_clear_periodic_advertiser_list_rp0_s
{
  uint8_t status;
} hci_le_clear_periodic_advertiser_list_rp0;

typedef PACKED(struct) hci_le_read_periodic_advertiser_list_size_rp0_s
{
  uint8_t status;
  uint8_t periodic_advertiser_list_size;
} hci_le_read_periodic_advertiser_list_size_rp0;

typedef PACKED(struct) hci_le_read_transmit_power_rp0_s
{
  uint8_t status;
  int8_t min_tx_power;
  int8_t max_tx_power;
} hci_le_read_transmit_power_rp0;

typedef PACKED(struct) hci_le_read_rf_path_compensation_rp0_s
{
  uint8_t status;
  int16_t rf_tx_path_compensation_value;
  int16_t rf_rx_path_compensation_value;
} hci_le_read_rf_path_compensation_rp0;

typedef PACKED(struct) hci_le_write_rf_path_compensation_cp0_s
{
  int16_t rf_tx_path_compensation_value;
  int16_t rf_rx_path_compensation_value;
} hci_le_write_rf_path_compensation_cp0;

typedef PACKED(struct) hci_le_write_rf_path_compensation_rp0_s
{
  uint8_t status;
} hci_le_write_rf_path_compensation_rp0;

typedef PACKED(struct) hci_le_set_privacy_mode_cp0_s
{
  uint8_t peer_identity_address_type;
  uint8_t peer_identity_address[6];
  uint8_t privacy_mode;
} hci_le_set_privacy_mode_cp0;

typedef PACKED(struct) hci_le_set_privacy_mode_rp0_s
{
  uint8_t status;
} hci_le_set_privacy_mode_rp0;

typedef PACKED(struct) hci_le_receiver_test_v3_cp0_s
{
  uint8_t rx_channel;
  uint8_t phy;
  uint8_t modulation_index;
  uint8_t expected_cte_length;
  uint8_t expected_cte_type;
  uint8_t slot_durations;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 7) / sizeof(uint8_t)];
} hci_le_receiver_test_v3_cp0;

typedef PACKED(struct) hci_le_receiver_test_v3_rp0_s
{
  uint8_t status;
} hci_le_receiver_test_v3_rp0;

typedef PACKED(struct) hci_le_transmitter_test_v3_cp0_s
{
  uint8_t tx_channel;
  uint8_t test_data_length;
  uint8_t packet_payload;
  uint8_t phy;
  uint8_t cte_length;
  uint8_t cte_type;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 7) / sizeof(uint8_t)];
} hci_le_transmitter_test_v3_cp0;

typedef PACKED(struct) hci_le_transmitter_test_v3_rp0_s
{
  uint8_t status;
} hci_le_transmitter_test_v3_rp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_parameters_cp0_s
{
  uint8_t advertising_handle;
  uint8_t cte_length;
  uint8_t cte_type;
  uint8_t cte_count;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} hci_le_set_connectionless_cte_transmit_parameters_cp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_parameters_rp0_s
{
  uint8_t status;
} hci_le_set_connectionless_cte_transmit_parameters_rp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_enable_cp0_s
{
  uint8_t advertising_handle;
  uint8_t cte_enable;
} hci_le_set_connectionless_cte_transmit_enable_cp0;

typedef PACKED(struct) hci_le_set_connectionless_cte_transmit_enable_rp0_s
{
  uint8_t status;
} hci_le_set_connectionless_cte_transmit_enable_rp0;

typedef PACKED(struct) hci_le_set_connectionless_iq_sampling_enable_cp0_s
{
  uint16_t sync_handle;
  uint8_t sampling_enable;
  uint8_t slot_durations;
  uint8_t max_sampled_cte_s;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} hci_le_set_connectionless_iq_sampling_enable_cp0;

typedef PACKED(struct) hci_le_set_connectionless_iq_sampling_enable_rp0_s
{
  uint8_t status;
  uint16_t sync_handle;
} hci_le_set_connectionless_iq_sampling_enable_rp0;

typedef PACKED(struct) hci_le_set_connection_cte_receive_parameters_cp0_s
{
  uint16_t connection_handle;
  uint8_t sampling_enable;
  uint8_t slot_durations;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} hci_le_set_connection_cte_receive_parameters_cp0;

typedef PACKED(struct) hci_le_set_connection_cte_receive_parameters_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_set_connection_cte_receive_parameters_rp0;

typedef PACKED(struct) hci_le_set_connection_cte_transmit_parameters_cp0_s
{
  uint16_t connection_handle;
  uint8_t cte_type;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 4) / sizeof(uint8_t)];
} hci_le_set_connection_cte_transmit_parameters_cp0;

