zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) hci_le_set_connection_cte_transmit_parameters_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_set_connection_cte_transmit_parameters_rp0;

typedef PACKED(struct) hci_le_connection_cte_request_enable_cp0_s
{
  uint16_t connection_handle;
  uint8_t enable;
  uint16_t cte_request_interval;
  uint8_t requested_cte_length;
  uint8_t requested_cte_type;
} hci_le_connection_cte_request_enable_cp0;

typedef PACKED(struct) hci_le_connection_cte_request_enable_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_connection_cte_request_enable_rp0;

typedef PACKED(struct) hci_le_connection_cte_response_enable_cp0_s
{
  uint16_t connection_handle;
  uint8_t enable;
} hci_le_connection_cte_response_enable_cp0;

typedef PACKED(struct) hci_le_connection_cte_response_enable_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_connection_cte_response_enable_rp0;

typedef PACKED(struct) hci_le_read_antenna_information_rp0_s
{
  uint8_t status;
  uint8_t supported_switching_sampling_rates;
  uint8_t num_antennae;
  uint8_t max_switching_pattern_length;
  uint8_t max_cte_length;
} hci_le_read_antenna_information_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_receive_enable_cp0_s
{
  uint16_t sync_handle;
  uint8_t enable;
} hci_le_set_periodic_advertising_receive_enable_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_receive_enable_rp0_s
{
  uint8_t status;
} hci_le_set_periodic_advertising_receive_enable_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_sync_transfer_cp0_s
{
  uint16_t connection_handle;
  uint16_t service_data;
  uint16_t sync_handle;
} hci_le_periodic_advertising_sync_transfer_cp0;

typedef PACKED(struct) hci_le_periodic_advertising_sync_transfer_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_periodic_advertising_sync_transfer_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_set_info_transfer_cp0_s
{
  uint16_t connection_handle;
  uint16_t service_data;
  uint8_t advertising_handle;
} hci_le_periodic_advertising_set_info_transfer_cp0;

typedef PACKED(struct) hci_le_periodic_advertising_set_info_transfer_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_periodic_advertising_set_info_transfer_rp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_sync_transfer_parameters_cp0_s
{
  uint16_t connection_handle;
  uint8_t mode;
  uint16_t skip;
  uint16_t sync_timeout;
  uint8_t cte_type;
} hci_le_set_periodic_advertising_sync_transfer_parameters_cp0;

typedef PACKED(struct) hci_le_set_periodic_advertising_sync_transfer_parameters_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_set_periodic_advertising_sync_transfer_parameters_rp0;

typedef PACKED(struct) hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0_s
{
  uint8_t mode;
  uint16_t skip;
  uint16_t sync_timeout;
  uint8_t cte_type;
} hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0;

typedef PACKED(struct) hci_le_set_default_periodic_advertising_sync_transfer_parameters_rp0_s
{
  uint8_t status;
} hci_le_set_default_periodic_advertising_sync_transfer_parameters_rp0;

typedef PACKED(struct) hci_le_enhanced_read_transmit_power_level_cp0_s
{
  uint16_t connection_handle;
  uint8_t phy;
} hci_le_enhanced_read_transmit_power_level_cp0;

typedef PACKED(struct) hci_le_enhanced_read_transmit_power_level_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t phy;
  int8_t current_transmit_power_level;
  int8_t max_transmit_power_level;
} hci_le_enhanced_read_transmit_power_level_rp0;

typedef PACKED(struct) hci_le_read_remote_transmit_power_level_cp0_s
{
  uint16_t connection_handle;
  uint8_t phy;
} hci_le_read_remote_transmit_power_level_cp0;

typedef PACKED(struct) hci_le_read_remote_transmit_power_level_rp0_s
{
  uint8_t status;
} hci_le_read_remote_transmit_power_level_rp0;

typedef PACKED(struct) hci_le_set_path_loss_reporting_parameters_cp0_s
{
  uint16_t connection_handle;
  uint8_t high_threshold;
  uint8_t high_hysteresis;
  uint8_t low_threshold;
  uint8_t low_hysteresis;
  uint16_t min_time_spent;
} hci_le_set_path_loss_reporting_parameters_cp0;

typedef PACKED(struct) hci_le_set_path_loss_reporting_parameters_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_set_path_loss_reporting_parameters_rp0;

typedef PACKED(struct) hci_le_set_path_loss_reporting_enable_cp0_s
{
  uint16_t connection_handle;
  uint8_t enable;
} hci_le_set_path_loss_reporting_enable_cp0;

typedef PACKED(struct) hci_le_set_path_loss_reporting_enable_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_set_path_loss_reporting_enable_rp0;

typedef PACKED(struct) hci_le_set_transmit_power_reporting_enable_cp0_s
{
  uint16_t connection_handle;
  uint8_t local_enable;
  uint8_t remote_enable;
} hci_le_set_transmit_power_reporting_enable_cp0;

typedef PACKED(struct) hci_le_set_transmit_power_reporting_enable_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_set_transmit_power_reporting_enable_rp0;

typedef PACKED(struct) hci_le_transmitter_test_v4_cp0_s
{
  uint8_t tx_channel;
  uint8_t test_data_length;
  uint8_t packet_payload;
  uint8_t phy;
  uint8_t cte_length;
  uint8_t cte_type;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 7) / sizeof(uint8_t)];
} hci_le_transmitter_test_v4_cp0;

typedef PACKED(struct) hci_le_transmitter_test_v4_cp1_s
{
  int8_t transmit_power_level;
} hci_le_transmitter_test_v4_cp1;

typedef PACKED(struct) hci_le_transmitter_test_v4_rp0_s
{
  uint8_t status;
} hci_le_transmitter_test_v4_rp0;

typedef PACKED(struct) aci_hal_get_fw_build_number_rp0_s
{
  uint8_t status;
  uint16_t build_number;
} aci_hal_get_fw_build_number_rp0;

typedef PACKED(struct) aci_hal_get_firmware_details_rp0_s
{
  uint8_t status;
  uint8_t dtm_version_major;
  uint8_t dtm_version_minor;
  uint8_t dtm_version_patch;
  uint8_t dtm_variant;
  uint16_t dtm_build_number;
  uint8_t btle_stack_version_major;
  uint8_t btle_stack_version_minor;
  uint8_t btle_stack_version_patch;
  uint8_t btle_stack_development;
  uint16_t btle_stack_variant;
  uint16_t btle_stack_build_number;
} aci_hal_get_firmware_details_rp0;

typedef PACKED(struct) aci_hal_write_config_data_cp0_s
{
  uint8_t offset;
  uint8_t length;
  uint8_t value[(HCI_MAX_PAYLOAD_SIZE - 2) / sizeof(uint8_t)];
} aci_hal_write_config_data_cp0;

typedef PACKED(struct) aci_hal_write_config_data_rp0_s
{
  uint8_t status;
} aci_hal_write_config_data_rp0;

typedef PACKED(struct) aci_hal_read_config_data_cp0_s
{
  uint8_t offset;
} aci_hal_read_config_data_cp0;

typedef PACKED(struct) aci_hal_read_config_data_rp0_s
{
  uint8_t status;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 2) / sizeof(uint8_t)];
} aci_hal_read_config_data_rp0;

typedef PACKED(struct) aci_hal_set_tx_power_level_cp0_s
{
  uint8_t en_high_power;
  uint8_t pa_level;
} aci_hal_set_tx_power_level_cp0;

typedef PACKED(struct) aci_hal_set_tx_power_level_rp0_s
{
  uint8_t status;
} aci_hal_set_tx_power_level_rp0;

typedef PACKED(struct) aci_hal_le_tx_test_packet_number_rp0_s
{
  uint8_t status;
  uint32_t number_of_packets;
} aci_hal_le_tx_test_packet_number_rp0;

typedef PACKED(struct) aci_hal_tone_start_cp0_s
{
  uint8_t rf_channel;
  uint8_t offset;
} aci_hal_tone_start_cp0;

typedef PACKED(struct) aci_hal_tone_start_rp0_s
{
  uint8_t status;
} aci_hal_tone_start_rp0;

typedef PACKED(struct) aci_hal_tone_stop_rp0_s
{
  uint8_t status;
} aci_hal_tone_stop_rp0;

typedef PACKED(struct) aci_hal_get_link_status_cp0_s
{
  uint8_t bank_index;
} aci_hal_get_link_status_cp0;

