zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) aci_hal_get_link_status_rp0_s
{
  uint8_t status;
  uint8_t link_status[8];
  uint16_t link_connection_handle[16 / 2];
} aci_hal_get_link_status_rp0;

typedef PACKED(struct) aci_hal_set_radio_activity_mask_cp0_s
{
  uint16_t radio_activity_mask;
} aci_hal_set_radio_activity_mask_cp0;

typedef PACKED(struct) aci_hal_set_radio_activity_mask_rp0_s
{
  uint8_t status;
} aci_hal_set_radio_activity_mask_rp0;

typedef PACKED(struct) aci_hal_set_event_mask_cp0_s
{
  uint32_t event_mask;
} aci_hal_set_event_mask_cp0;

typedef PACKED(struct) aci_hal_set_event_mask_rp0_s
{
  uint8_t status;
} aci_hal_set_event_mask_rp0;

typedef PACKED(struct) aci_hal_set_le_power_control_cp0_s
{
  uint8_t enable;
  uint8_t phy;
  int8_t rssi_target;
  uint8_t rssi_hysteresis;
  int8_t initial_tx_power;
  uint8_t rssi_filtering_coefficient;
} aci_hal_set_le_power_control_cp0;

typedef PACKED(struct) aci_hal_set_le_power_control_rp0_s
{
  uint8_t status;
} aci_hal_set_le_power_control_rp0;

typedef PACKED(struct) aci_hal_updater_start_rp0_s
{
  uint8_t status;
} aci_hal_updater_start_rp0;

typedef PACKED(struct) aci_hal_get_updater_version_rp0_s
{
  uint8_t status;
  uint8_t version;
} aci_hal_get_updater_version_rp0;

typedef PACKED(struct) aci_hal_get_updater_bufsize_rp0_s
{
  uint8_t status;
  uint8_t buffer_size;
} aci_hal_get_updater_bufsize_rp0;

typedef PACKED(struct) aci_hal_updater_erase_blue_flag_rp0_s
{
  uint8_t status;
} aci_hal_updater_erase_blue_flag_rp0;

typedef PACKED(struct) aci_hal_updater_reset_blue_flag_rp0_s
{
  uint8_t status;
} aci_hal_updater_reset_blue_flag_rp0;

typedef PACKED(struct) aci_hal_updater_erase_sector_cp0_s
{
  uint32_t address;
} aci_hal_updater_erase_sector_cp0;

typedef PACKED(struct) aci_hal_updater_erase_sector_rp0_s
{
  uint8_t status;
} aci_hal_updater_erase_sector_rp0;

typedef PACKED(struct) aci_hal_updater_prog_data_blk_cp0_s
{
  uint32_t address;
  uint16_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_hal_updater_prog_data_blk_cp0;

typedef PACKED(struct) aci_hal_updater_prog_data_blk_rp0_s
{
  uint8_t status;
} aci_hal_updater_prog_data_blk_rp0;

typedef PACKED(struct) aci_hal_updater_read_data_blk_cp0_s
{
  uint32_t address;
  uint16_t data_length;
} aci_hal_updater_read_data_blk_cp0;

typedef PACKED(struct) aci_hal_updater_read_data_blk_rp0_s
{
  uint8_t status;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 1) / sizeof(uint8_t)];
} aci_hal_updater_read_data_blk_rp0;

typedef PACKED(struct) aci_hal_updater_calc_crc_cp0_s
{
  uint32_t address;
  uint8_t num_of_sectors;
} aci_hal_updater_calc_crc_cp0;

typedef PACKED(struct) aci_hal_updater_calc_crc_rp0_s
{
  uint8_t status;
  uint32_t crc;
} aci_hal_updater_calc_crc_rp0;

typedef PACKED(struct) aci_hal_updater_hw_version_rp0_s
{
  uint8_t status;
  uint8_t hw_version;
} aci_hal_updater_hw_version_rp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_cp0_s
{
  uint8_t tx_frequency;
  uint8_t length_of_test_data;
  uint8_t packet_payload;
  uint16_t number_of_packets;
  uint8_t phy;
} aci_hal_transmitter_test_packets_cp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_rp0_s
{
  uint8_t status;
} aci_hal_transmitter_test_packets_rp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_v2_cp0_s
{
  uint8_t tx_channel;
  uint8_t test_data_length;
  uint8_t packet_payload;
  uint16_t number_of_packets;
  uint8_t phy;
  uint8_t cte_length;
  uint8_t cte_type;
  uint8_t switching_pattern_length;
  uint8_t antenna_ids[(HCI_MAX_PAYLOAD_SIZE - 9) / sizeof(uint8_t)];
} aci_hal_transmitter_test_packets_v2_cp0;

typedef PACKED(struct) aci_hal_transmitter_test_packets_v2_rp0_s
{
  uint8_t status;
} aci_hal_transmitter_test_packets_v2_rp0;

typedef PACKED(struct) aci_hal_set_priority_cp0_s
{
  uint8_t ble_state;
  uint16_t connection_handle;
  uint8_t priority_max;
  uint8_t priority_min;
} aci_hal_set_priority_cp0;

typedef PACKED(struct) aci_hal_set_priority_rp0_s
{
  uint8_t status;
} aci_hal_set_priority_rp0;

typedef PACKED(struct) aci_hal_set_ce_length_cp0_s
{
  uint16_t ce_length;
} aci_hal_set_ce_length_cp0;

typedef PACKED(struct) aci_hal_set_ce_length_rp0_s
{
  uint8_t status;
} aci_hal_set_ce_length_rp0;

typedef PACKED(struct) aci_hal_write_radio_reg_cp0_s
{
  uint32_t start_address;
  uint8_t num_bytes;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} aci_hal_write_radio_reg_cp0;

typedef PACKED(struct) aci_hal_write_radio_reg_rp0_s
{
  uint8_t status;
} aci_hal_write_radio_reg_rp0;

typedef PACKED(struct) aci_hal_read_radio_reg_cp0_s
{
  uint32_t start_address;
  uint8_t num_bytes;
} aci_hal_read_radio_reg_cp0;

typedef PACKED(struct) aci_hal_read_radio_reg_rp0_s
{
  uint8_t status;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 2) / sizeof(uint8_t)];
} aci_hal_read_radio_reg_rp0;

typedef PACKED(struct) aci_hal_set_antenna_switch_parameters_cp0_s
{
  uint8_t antenna_ids;
  uint8_t antenna_id_shift;
  uint8_t default_antenna_id;
  uint8_t rf_activity_enable;
} aci_hal_set_antenna_switch_parameters_cp0;

typedef PACKED(struct) aci_hal_set_antenna_switch_parameters_rp0_s
{
  uint8_t status;
} aci_hal_set_antenna_switch_parameters_rp0;

typedef PACKED(struct) aci_hal_get_evt_fifo_max_level_rp0_s
{
  uint8_t status;
  uint16_t isr0_fifo_max_level;
  uint16_t isr1_fifo_max_level;
  uint16_t user_fifo_max_level;
} aci_hal_get_evt_fifo_max_level_rp0;

typedef PACKED(struct) aci_gap_set_io_capability_cp0_s
{
  uint8_t io_capability;
} aci_gap_set_io_capability_cp0;

typedef PACKED(struct) aci_gap_set_io_capability_rp0_s
{
  uint8_t status;
} aci_gap_set_io_capability_rp0;

typedef PACKED(struct) aci_gap_set_authentication_requirement_cp0_s
{
  uint8_t bonding_mode;
  uint8_t mitm_mode;
  uint8_t sc_support;
  uint8_t key_press_notification_support;
  uint8_t min_encryption_key_size;
  uint8_t max_encryption_key_size;
  uint8_t use_fixed_pin;
  uint32_t fixed_pin;
} aci_gap_set_authentication_requirement_cp0;

typedef PACKED(struct) aci_gap_set_authentication_requirement_rp0_s
{
  uint8_t status;
} aci_gap_set_authentication_requirement_rp0;

typedef PACKED(struct) aci_gap_set_authorization_requirement_cp0_s
{
  uint16_t connection_handle;
  uint8_t authorization_enable;
} aci_gap_set_authorization_requirement_cp0;

typedef PACKED(struct) aci_gap_set_authorization_requirement_rp0_s
{
  uint8_t status;
} aci_gap_set_authorization_requirement_rp0;

