zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) aci_gap_pass_key_resp_cp0_s
{
  uint16_t connection_handle;
  uint32_t pass_key;
} aci_gap_pass_key_resp_cp0;

typedef PACKED(struct) aci_gap_pass_key_resp_rp0_s
{
  uint8_t status;
} aci_gap_pass_key_resp_rp0;

typedef PACKED(struct) aci_gap_authorization_resp_cp0_s
{
  uint16_t connection_handle;
  uint8_t authorize;
} aci_gap_authorization_resp_cp0;

typedef PACKED(struct) aci_gap_authorization_resp_rp0_s
{
  uint8_t status;
} aci_gap_authorization_resp_rp0;

typedef PACKED(struct) aci_gap_init_cp0_s
{
  uint8_t role;
  uint8_t privacy_type;
  uint8_t device_name_char_len;
  uint8_t identity_address_type;
} aci_gap_init_cp0;

typedef PACKED(struct) aci_gap_init_rp0_s
{
  uint8_t status;
  uint16_t service_handle;
  uint16_t dev_name_char_handle;
  uint16_t appearance_char_handle;
} aci_gap_init_rp0;

typedef PACKED(struct) aci_gap_slave_security_req_cp0_s
{
  uint16_t connection_handle;
} aci_gap_slave_security_req_cp0;

typedef PACKED(struct) aci_gap_slave_security_req_rp0_s
{
  uint8_t status;
} aci_gap_slave_security_req_rp0;

typedef PACKED(struct) aci_gap_get_security_level_cp0_s
{
  uint16_t connection_handle;
} aci_gap_get_security_level_cp0;

typedef PACKED(struct) aci_gap_get_security_level_rp0_s
{
  uint8_t status;
  uint8_t security_mode;
  uint8_t security_level;
} aci_gap_get_security_level_rp0;

typedef PACKED(struct) aci_gap_set_event_mask_cp0_s
{
  uint16_t gap_evt_mask;
} aci_gap_set_event_mask_cp0;

typedef PACKED(struct) aci_gap_set_event_mask_rp0_s
{
  uint8_t status;
} aci_gap_set_event_mask_rp0;

typedef PACKED(struct) aci_gap_terminate_cp0_s
{
  uint16_t connection_handle;
  uint8_t reason;
} aci_gap_terminate_cp0;

typedef PACKED(struct) aci_gap_terminate_rp0_s
{
  uint8_t status;
} aci_gap_terminate_rp0;

typedef PACKED(struct) aci_gap_clear_security_db_rp0_s
{
  uint8_t status;
} aci_gap_clear_security_db_rp0;

typedef PACKED(struct) aci_gap_allow_rebond_cp0_s
{
  uint16_t connection_handle;
} aci_gap_allow_rebond_cp0;

typedef PACKED(struct) aci_gap_allow_rebond_rp0_s
{
  uint8_t status;
} aci_gap_allow_rebond_rp0;

typedef PACKED(struct) aci_gap_create_connection_cp0_s
{
  uint8_t initiating_phy;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
} aci_gap_create_connection_cp0;

typedef PACKED(struct) aci_gap_create_connection_rp0_s
{
  uint8_t status;
} aci_gap_create_connection_rp0;

typedef PACKED(struct) aci_gap_terminate_proc_cp0_s
{
  uint8_t procedure_code;
} aci_gap_terminate_proc_cp0;

typedef PACKED(struct) aci_gap_terminate_proc_rp0_s
{
  uint8_t status;
} aci_gap_terminate_proc_rp0;

typedef PACKED(struct) aci_gap_start_connection_update_cp0_s
{
  uint16_t connection_handle;
  uint16_t conn_interval_min;
  uint16_t conn_interval_max;
  uint16_t conn_latency;
  uint16_t supervision_timeout;
  uint16_t minimum_ce_length;
  uint16_t maximum_ce_length;
} aci_gap_start_connection_update_cp0;

typedef PACKED(struct) aci_gap_start_connection_update_rp0_s
{
  uint8_t status;
} aci_gap_start_connection_update_rp0;

typedef PACKED(struct) aci_gap_send_pairing_req_cp0_s
{
  uint16_t connection_handle;
  uint8_t force_rebond;
} aci_gap_send_pairing_req_cp0;

typedef PACKED(struct) aci_gap_send_pairing_req_rp0_s
{
  uint8_t status;
} aci_gap_send_pairing_req_rp0;

typedef PACKED(struct) aci_gap_resolve_private_addr_cp0_s
{
  uint8_t address[6];
} aci_gap_resolve_private_addr_cp0;

typedef PACKED(struct) aci_gap_resolve_private_addr_rp0_s
{
  uint8_t status;
  uint8_t actual_address[6];
} aci_gap_resolve_private_addr_rp0;

typedef PACKED(struct) aci_gap_get_bonded_devices_cp0_s
{
  uint8_t offset;
  uint8_t max_num_of_addresses;
} aci_gap_get_bonded_devices_cp0;

typedef PACKED(struct) aci_gap_get_bonded_devices_rp0_s
{
  uint8_t status;
  uint8_t num_of_addresses;
  packed_bonded_device_entry_t bonded_device_entry[(HCI_MAX_PAYLOAD_SIZE - 2) / sizeof(packed_bonded_device_entry_t)];
} aci_gap_get_bonded_devices_rp0;

typedef PACKED(struct) aci_gap_is_device_bonded_cp0_s
{
  uint8_t peer_address_type;
  uint8_t peer_address[6];
} aci_gap_is_device_bonded_cp0;

typedef PACKED(struct) aci_gap_is_device_bonded_rp0_s
{
  uint8_t status;
} aci_gap_is_device_bonded_rp0;

typedef PACKED(struct) aci_gap_numeric_comparison_value_confirm_yesno_cp0_s
{
  uint16_t connection_handle;
  uint8_t confirm_yes_no;
} aci_gap_numeric_comparison_value_confirm_yesno_cp0;

typedef PACKED(struct) aci_gap_numeric_comparison_value_confirm_yesno_rp0_s
{
  uint8_t status;
} aci_gap_numeric_comparison_value_confirm_yesno_rp0;

typedef PACKED(struct) aci_gap_passkey_input_cp0_s
{
  uint16_t connection_handle;
  uint8_t input_type;
} aci_gap_passkey_input_cp0;

typedef PACKED(struct) aci_gap_passkey_input_rp0_s
{
  uint8_t status;
} aci_gap_passkey_input_rp0;

typedef PACKED(struct) aci_gap_get_oob_data_cp0_s
{
  uint8_t oob_data_type;
} aci_gap_get_oob_data_cp0;

typedef PACKED(struct) aci_gap_get_oob_data_rp0_s
{
  uint8_t status;
  uint8_t address_type;
  uint8_t address[6];
  uint8_t oob_data_type;
  uint8_t oob_data_len;
  uint8_t oob_data[16];
} aci_gap_get_oob_data_rp0;

typedef PACKED(struct) aci_gap_set_oob_data_cp0_s
{
  uint8_t device_type;
  uint8_t address_type;
  uint8_t address[6];
  uint8_t oob_data_type;
  uint8_t oob_data_len;
  uint8_t oob_data[16];
} aci_gap_set_oob_data_cp0;

typedef PACKED(struct) aci_gap_set_oob_data_rp0_s
{
  uint8_t status;
} aci_gap_set_oob_data_rp0;

typedef PACKED(struct) aci_gap_remove_bonded_device_cp0_s
{
  uint8_t peer_identity_address_type;
  uint8_t peer_identity_address[6];
} aci_gap_remove_bonded_device_cp0;

typedef PACKED(struct) aci_gap_remove_bonded_device_rp0_s
{
  uint8_t status;
} aci_gap_remove_bonded_device_rp0;

typedef PACKED(struct) aci_gap_set_advertising_configuration_cp0_s
{
  uint8_t advertising_handle;
  uint8_t discoverable_mode;
  uint16_t advertising_event_properties;
  uint32_t primary_advertising_interval_min;
  uint32_t primary_advertising_interval_max;
  uint8_t primary_advertising_channel_map;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
  uint8_t advertising_filter_policy;
  int8_t advertising_tx_power;
  uint8_t primary_advertising_phy;
  uint8_t secondary_advertising_max_skip;
  uint8_t secondary_advertising_phy;
  uint8_t advertising_sid;
  uint8_t scan_request_notification_enable;
} aci_gap_set_advertising_configuration_cp0;

typedef PACKED(struct) aci_gap_set_advertising_configuration_rp0_s
{
  uint8_t status;
} aci_gap_set_advertising_configuration_rp0;

typedef PACKED(struct) aci_gap_set_advertising_enable_cp0_s
{
  uint8_t enable;
  uint8_t number_of_sets;
  packed_advertising_set_parameters_t advertising_set_parameters[(HCI_MAX_PAYLOAD_SIZE - 2) /
                                                                 sizeof(packed_advertising_set_parameters_t)];
} aci_gap_set_advertising_enable_cp0;

typedef PACKED(struct) aci_gap_set_advertising_enable_rp0_s
{
  uint8_t status;
} aci_gap_set_advertising_enable_rp0;

typedef PACKED(struct) aci_gap_set_advertising_data_nwk_cp0_s
{
  uint8_t advertising_handle;
  uint8_t operation;
  uint8_t advertising_data_length;
  uint8_t advertising_data[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(uint8_t)];
} aci_gap_set_advertising_data_nwk_cp0;

typedef PACKED(struct) aci_gap_set_advertising_data_nwk_rp0_s
{
  uint8_t status;
} aci_gap_set_advertising_data_nwk_rp0;

