zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) aci_gap_set_scan_response_data_nwk_cp0_s
{
  uint8_t advertising_handle;
  uint8_t operation;
  uint8_t scan_response_data_length;
  uint8_t scan_response_data[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(uint8_t)];
} aci_gap_set_scan_response_data_nwk_cp0;

typedef PACKED(struct) aci_gap_set_scan_response_data_nwk_rp0_s
{
  uint8_t status;
} aci_gap_set_scan_response_data_nwk_rp0;

typedef PACKED(struct) aci_gap_set_scan_configuration_cp0_s
{
  uint8_t filter_duplicates;
  uint8_t scanning_filter_policy;
  uint8_t Scanning_PHY;
  uint8_t scan_type;
  uint16_t scan_interval;
  uint16_t scan_window;
} aci_gap_set_scan_configuration_cp0;

typedef PACKED(struct) aci_gap_set_scan_configuration_rp0_s
{
  uint8_t status;
} aci_gap_set_scan_configuration_rp0;

typedef PACKED(struct) aci_gap_set_connection_configuration_cp0_s
{
  uint8_t initiating_phy;
  uint16_t conn_interval_min;
  uint16_t conn_interval_max;
  uint16_t conn_latency;
  uint16_t supervision_timeout;
  uint16_t minimum_ce_length;
  uint16_t maximum_ce_length;
} aci_gap_set_connection_configuration_cp0;

typedef PACKED(struct) aci_gap_set_connection_configuration_rp0_s
{
  uint8_t status;
} aci_gap_set_connection_configuration_rp0;

typedef PACKED(struct) aci_gap_start_procedure_cp0_s
{
  uint8_t procedure_code;
  uint8_t phy_s;
  uint16_t duration;
  uint16_t period;
} aci_gap_start_procedure_cp0;

typedef PACKED(struct) aci_gap_start_procedure_rp0_s
{
  uint8_t status;
} aci_gap_start_procedure_rp0;

typedef PACKED(struct) aci_gap_discover_name_cp0_s
{
  uint8_t phy_s;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
} aci_gap_discover_name_cp0;

typedef PACKED(struct) aci_gap_discover_name_rp0_s
{
  uint8_t status;
} aci_gap_discover_name_rp0;

typedef PACKED(struct) aci_gap_add_devices_to_white_and_resolving_list_cp0_s
{
  uint8_t lists;
  uint8_t clear_lists;
  uint8_t num_of_list_entries;
  packed_list_entry_t list_entry[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(packed_list_entry_t)];
} aci_gap_add_devices_to_white_and_resolving_list_cp0;

typedef PACKED(struct) aci_gap_add_devices_to_white_and_resolving_list_rp0_s
{
  uint8_t status;
} aci_gap_add_devices_to_white_and_resolving_list_rp0;

typedef PACKED(struct) aci_gap_configure_white_and_resolving_list_cp0_s
{
  uint8_t lists;
} aci_gap_configure_white_and_resolving_list_cp0;

typedef PACKED(struct) aci_gap_configure_white_and_resolving_list_rp0_s
{
  uint8_t status;
} aci_gap_configure_white_and_resolving_list_rp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_configuration_cp0_s
{
  uint8_t advertising_handle;
  uint16_t periodic_advertising_interval_min;
  uint16_t periodic_advertising_interval_max;
  uint16_t periodic_advertising_properties;
} aci_gap_set_periodic_advertising_configuration_cp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_configuration_rp0_s
{
  uint8_t status;
} aci_gap_set_periodic_advertising_configuration_rp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_data_nwk_cp0_s
{
  uint8_t advertising_handle;
  uint8_t operation;
  uint8_t advertising_data_length;
  uint8_t advertising_data[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(uint8_t)];
} aci_gap_set_periodic_advertising_data_nwk_cp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_data_nwk_rp0_s
{
  uint8_t status;
} aci_gap_set_periodic_advertising_data_nwk_rp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_enable_cp0_s
{
  uint8_t enable;
  uint8_t advertising_handle;
} aci_gap_set_periodic_advertising_enable_cp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_enable_rp0_s
{
  uint8_t status;
} aci_gap_set_periodic_advertising_enable_rp0;

typedef PACKED(struct) aci_gap_periodic_advertising_create_sync_cp0_s
{
  uint8_t options;
  uint8_t advertising_sid;
  uint8_t advertising_address_type;
  uint8_t advertising_address[6];
  uint16_t skip;
  uint16_t sync_timeout;
  uint8_t sync_cte_type;
} aci_gap_periodic_advertising_create_sync_cp0;

typedef PACKED(struct) aci_gap_periodic_advertising_create_sync_rp0_s
{
  uint8_t status;
} aci_gap_periodic_advertising_create_sync_rp0;

typedef PACKED(struct) aci_gap_periodic_advertising_create_sync_cancel_rp0_s
{
  uint8_t status;
} aci_gap_periodic_advertising_create_sync_cancel_rp0;

typedef PACKED(struct) aci_gap_remove_advertising_set_cp0_s
{
  uint8_t advertising_handle;
} aci_gap_remove_advertising_set_cp0;

typedef PACKED(struct) aci_gap_remove_advertising_set_rp0_s
{
  uint8_t status;
} aci_gap_remove_advertising_set_rp0;

typedef PACKED(struct) aci_gap_clear_advertising_sets_rp0_s
{
  uint8_t status;
} aci_gap_clear_advertising_sets_rp0;

typedef PACKED(struct) aci_gap_periodic_advertising_terminate_sync_cp0_s
{
  uint16_t sync_handle;
} aci_gap_periodic_advertising_terminate_sync_cp0;

typedef PACKED(struct) aci_gap_periodic_advertising_terminate_sync_rp0_s
{
  uint8_t status;
} aci_gap_periodic_advertising_terminate_sync_rp0;

typedef PACKED(struct) aci_gap_add_device_to_periodic_advertiser_list_cp0_s
{
  uint8_t advertiser_address_type;
  uint8_t advertising_address[6];
  uint8_t advertising_sid;
} aci_gap_add_device_to_periodic_advertiser_list_cp0;

typedef PACKED(struct) aci_gap_add_device_to_periodic_advertiser_list_rp0_s
{
  uint8_t status;
} aci_gap_add_device_to_periodic_advertiser_list_rp0;

typedef PACKED(struct) aci_gap_remove_device_from_periodic_advertising_list_cp0_s
{
  uint8_t advertiser_address_type;
  uint8_t advertising_address[6];
  uint8_t advertising_sid;
} aci_gap_remove_device_from_periodic_advertising_list_cp0;

typedef PACKED(struct) aci_gap_remove_device_from_periodic_advertising_list_rp0_s
{
  uint8_t status;
} aci_gap_remove_device_from_periodic_advertising_list_rp0;

typedef PACKED(struct) aci_gap_clear_periodic_advertiser_list_rp0_s
{
  uint8_t status;
} aci_gap_clear_periodic_advertiser_list_rp0;

typedef PACKED(struct) aci_gap_read_periodic_advertiser_list_size_rp0_s
{
  uint8_t status;
  uint8_t periodic_advertiser_list_size;
} aci_gap_read_periodic_advertiser_list_size_rp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_receive_enable_cp0_s
{
  uint16_t sync_handle;
  uint8_t enable;
} aci_gap_set_periodic_advertising_receive_enable_cp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_receive_enable_rp0_s
{
  uint8_t status;
} aci_gap_set_periodic_advertising_receive_enable_rp0;

typedef PACKED(struct) aci_gap_periodic_advertising_sync_transfer_cp0_s
{
  uint16_t connection_handle;
  uint16_t service_data;
  uint16_t sync_handle;
} aci_gap_periodic_advertising_sync_transfer_cp0;

typedef PACKED(struct) aci_gap_periodic_advertising_sync_transfer_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} aci_gap_periodic_advertising_sync_transfer_rp0;

typedef PACKED(struct) aci_gap_periodic_advertising_set_info_transfer_cp0_s
{
  uint16_t connection_handle;
  uint16_t service_data;
  uint8_t advertising_handle;
} aci_gap_periodic_advertising_set_info_transfer_cp0;

typedef PACKED(struct) aci_gap_periodic_advertising_set_info_transfer_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} aci_gap_periodic_advertising_set_info_transfer_rp0;

typedef PACKED(struct) aci_gap_set_periodic_advertising_sync_transfer_parameters_cp0_s
{
  uint16_t connection_handle;
  uint8_t mode;
  uint16_t skip;
  uint16_t sync_timeout;
  uint8_t cte_type;
} aci_gap_set_periodic_advertising_sync_transfer_parameters_cp0;

