zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) aci_gap_set_periodic_advertising_sync_transfer_parameters_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} aci_gap_set_periodic_advertising_sync_transfer_parameters_rp0;

typedef PACKED(struct) aci_gap_set_default_periodic_advertising_sync_transfer_parameters_cp0_s
{
  uint8_t mode;
  uint16_t skip;
  uint16_t sync_timeout;
  uint8_t cte_type;
} aci_gap_set_default_periodic_advertising_sync_transfer_parameters_cp0;

typedef PACKED(struct) aci_gap_set_default_periodic_advertising_sync_transfer_parameters_rp0_s
{
  uint8_t status;
} aci_gap_set_default_periodic_advertising_sync_transfer_parameters_rp0;

typedef PACKED(struct) aci_gatt_srv_init_rp0_s
{
  uint8_t status;
} aci_gatt_srv_init_rp0;

typedef PACKED(struct) aci_gatt_srv_add_service_nwk_cp0_s
{
  uint8_t service_uuid_type;
  packed_service_uuid_t Service_UUID;
} aci_gatt_srv_add_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_add_service_nwk_cp1_s
{
  uint8_t service_type;
  uint8_t max_attribute_records;
} aci_gatt_srv_add_service_nwk_cp1;

typedef PACKED(struct) aci_gatt_srv_add_service_nwk_rp0_s
{
  uint8_t status;
  uint16_t service_handle;
} aci_gatt_srv_add_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_include_service_nwk_cp0_s
{
  uint16_t service_handle;
  uint16_t included_service_handle;
} aci_gatt_srv_include_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_include_service_nwk_rp0_s
{
  uint8_t status;
  uint16_t include_handle;
} aci_gatt_srv_include_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_add_char_nwk_cp0_s
{
  uint16_t service_handle;
  uint8_t char_uuid_type;
  packed_char_uuid_t char_uuid;
} aci_gatt_srv_add_char_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_add_char_nwk_cp1_s
{
  uint16_t char_value_length;
  uint8_t char_properties;
  uint8_t security_permissions;
  uint8_t gatt_evt_mask;
  uint8_t enc_key_size;
  uint8_t is_variable;
} aci_gatt_srv_add_char_nwk_cp1;

typedef PACKED(struct) aci_gatt_srv_add_char_nwk_rp0_s
{
  uint8_t status;
  uint16_t char_handle;
} aci_gatt_srv_add_char_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_cp0_s
{
  uint16_t char_handle;
  uint8_t char_desc_uuid_type;
  packed_char_desc_uuid_t char_desc_uuid;
} aci_gatt_srv_add_char_desc_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_cp1_s
{
  uint16_t char_desc_value_max_len;
  uint16_t char_desc_value_length;
  uint8_t char_desc_value[(HCI_MAX_PAYLOAD_SIZE - 4) / sizeof(uint8_t)];
} aci_gatt_srv_add_char_desc_nwk_cp1;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_cp2_s
{
  uint8_t security_permissions;
  uint8_t access_permissions;
  uint8_t gatt_evt_mask;
  uint8_t enc_key_size;
  uint8_t is_variable;
} aci_gatt_srv_add_char_desc_nwk_cp2;

typedef PACKED(struct) aci_gatt_srv_add_char_desc_nwk_rp0_s
{
  uint8_t status;
  uint16_t char_desc_handle;
} aci_gatt_srv_add_char_desc_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_write_handle_value_nwk_cp0_s
{
  uint16_t attr_handle;
  uint16_t val_offset;
  uint16_t value_length;
  uint8_t value[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_srv_write_handle_value_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_write_handle_value_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_write_handle_value_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_rm_char_nwk_cp0_s
{
  uint16_t char_handle;
} aci_gatt_srv_rm_char_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_rm_char_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_rm_char_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_rm_service_nwk_cp0_s
{
  uint16_t serv_handle;
} aci_gatt_srv_rm_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_rm_service_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_rm_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_rm_include_service_nwk_cp0_s
{
  uint16_t include_handle;
} aci_gatt_srv_rm_include_service_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_rm_include_service_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_rm_include_service_nwk_rp0;

typedef PACKED(struct) aci_gatt_set_event_mask_cp0_s
{
  uint32_t gatt_evt_mask;
} aci_gatt_set_event_mask_cp0;

typedef PACKED(struct) aci_gatt_set_event_mask_rp0_s
{
  uint8_t status;
} aci_gatt_set_event_mask_rp0;

typedef PACKED(struct) aci_gatt_clt_exchange_config_cp0_s
{
  uint16_t connection_handle;
} aci_gatt_clt_exchange_config_cp0;

typedef PACKED(struct) aci_gatt_clt_exchange_config_rp0_s
{
  uint8_t status;
} aci_gatt_clt_exchange_config_rp0;

typedef PACKED(struct) aci_gatt_clt_prepare_write_req_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t val_offset;
  uint16_t attribute_val_length;
  uint8_t attribute_val[(HCI_MAX_PAYLOAD_SIZE - 8) / sizeof(uint8_t)];
} aci_gatt_clt_prepare_write_req_cp0;

typedef PACKED(struct) aci_gatt_clt_prepare_write_req_rp0_s
{
  uint8_t status;
} aci_gatt_clt_prepare_write_req_rp0;

typedef PACKED(struct) aci_gatt_clt_execute_write_req_cp0_s
{
  uint16_t connection_handle;
  uint8_t execute;
} aci_gatt_clt_execute_write_req_cp0;

typedef PACKED(struct) aci_gatt_clt_execute_write_req_rp0_s
{
  uint8_t status;
} aci_gatt_clt_execute_write_req_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_primary_services_cp0_s
{
  uint16_t connection_handle;
} aci_gatt_clt_disc_all_primary_services_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_primary_services_rp0_s
{
  uint8_t status;
} aci_gatt_clt_disc_all_primary_services_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_primary_service_by_uuid_cp0_s
{
  uint16_t connection_handle;
  uint8_t uuid_type;
  packed_uuid_t uuid;
} aci_gatt_clt_disc_primary_service_by_uuid_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_primary_service_by_uuid_rp0_s
{
  uint8_t status;
} aci_gatt_clt_disc_primary_service_by_uuid_rp0;

typedef PACKED(struct) aci_gatt_clt_find_included_services_cp0_s
{
  uint16_t connection_handle;
  uint16_t start_handle;
  uint16_t end_handle;
} aci_gatt_clt_find_included_services_cp0;

typedef PACKED(struct) aci_gatt_clt_find_included_services_rp0_s
{
  uint8_t status;
} aci_gatt_clt_find_included_services_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_of_service_cp0_s
{
  uint16_t connection_handle;
  uint16_t start_handle;
  uint16_t end_handle;
} aci_gatt_clt_disc_all_char_of_service_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_of_service_rp0_s
{
  uint8_t status;
} aci_gatt_clt_disc_all_char_of_service_rp0;

