zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) aci_gatt_clt_disc_char_by_uuid_cp0_s
{
  uint16_t connection_handle;
  uint16_t start_handle;
  uint16_t end_handle;
  uint8_t uuid_type;
  packed_uuid_t uuid;
} aci_gatt_clt_disc_char_by_uuid_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_char_by_uuid_rp0_s
{
  uint8_t status;
} aci_gatt_clt_disc_char_by_uuid_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_desc_cp0_s
{
  uint16_t connection_handle;
  uint16_t char_handle;
  uint16_t end_handle;
} aci_gatt_clt_disc_all_char_desc_cp0;

typedef PACKED(struct) aci_gatt_clt_disc_all_char_desc_rp0_s
{
  uint8_t status;
} aci_gatt_clt_disc_all_char_desc_rp0;

typedef PACKED(struct) aci_gatt_clt_read_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
} aci_gatt_clt_read_cp0;

typedef PACKED(struct) aci_gatt_clt_read_rp0_s
{
  uint8_t status;
} aci_gatt_clt_read_rp0;

typedef PACKED(struct) aci_gatt_clt_read_using_char_uuid_cp0_s
{
  uint16_t connection_handle;
  uint16_t start_handle;
  uint16_t end_handle;
  uint8_t uuid_type;
  packed_uuid_t uuid;
} aci_gatt_clt_read_using_char_uuid_cp0;

typedef PACKED(struct) aci_gatt_clt_read_using_char_uuid_rp0_s
{
  uint8_t status;
} aci_gatt_clt_read_using_char_uuid_rp0;

typedef PACKED(struct) aci_gatt_clt_read_long_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t val_offset;
} aci_gatt_clt_read_long_cp0;

typedef PACKED(struct) aci_gatt_clt_read_long_rp0_s
{
  uint8_t status;
} aci_gatt_clt_read_long_rp0;

typedef PACKED(struct) aci_gatt_clt_read_multiple_char_value_cp0_s
{
  uint16_t connection_handle;
  uint8_t number_of_handles;
  packed_handle_entry_t handle_entry[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(packed_handle_entry_t)];
} aci_gatt_clt_read_multiple_char_value_cp0;

typedef PACKED(struct) aci_gatt_clt_read_multiple_char_value_rp0_s
{
  uint8_t status;
} aci_gatt_clt_read_multiple_char_value_rp0;

typedef PACKED(struct) aci_gatt_clt_write_nwk_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t attribute_val_length;
  uint8_t attribute_val[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_clt_write_nwk_cp0;

typedef PACKED(struct) aci_gatt_clt_write_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_clt_write_nwk_rp0;

typedef PACKED(struct) aci_gatt_clt_write_long_nwk_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t val_offset;
  uint16_t attribute_val_length;
  uint8_t attribute_val[(HCI_MAX_PAYLOAD_SIZE - 8) / sizeof(uint8_t)];
} aci_gatt_clt_write_long_nwk_cp0;

typedef PACKED(struct) aci_gatt_clt_write_long_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_clt_write_long_nwk_rp0;

typedef PACKED(struct) aci_gatt_clt_write_char_reliable_nwk_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t val_offset;
  uint16_t attribute_val_length;
  uint8_t attribute_val[(HCI_MAX_PAYLOAD_SIZE - 8) / sizeof(uint8_t)];
} aci_gatt_clt_write_char_reliable_nwk_cp0;

typedef PACKED(struct) aci_gatt_clt_write_char_reliable_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_clt_write_char_reliable_nwk_rp0;

typedef PACKED(struct) aci_gatt_clt_write_without_resp_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t attribute_val_length;
  uint8_t attribute_val[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_clt_write_without_resp_cp0;

typedef PACKED(struct) aci_gatt_clt_write_without_resp_rp0_s
{
  uint8_t status;
} aci_gatt_clt_write_without_resp_rp0;

typedef PACKED(struct) aci_gatt_clt_signed_write_without_resp_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t attribute_val_length;
  uint8_t attribute_val[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_clt_signed_write_without_resp_cp0;

typedef PACKED(struct) aci_gatt_clt_signed_write_without_resp_rp0_s
{
  uint8_t status;
} aci_gatt_clt_signed_write_without_resp_rp0;

typedef PACKED(struct) aci_gatt_clt_confirm_indication_cp0_s
{
  uint16_t connection_handle;
} aci_gatt_clt_confirm_indication_cp0;

typedef PACKED(struct) aci_gatt_clt_confirm_indication_rp0_s
{
  uint8_t status;
} aci_gatt_clt_confirm_indication_rp0;

typedef PACKED(struct) aci_gatt_srv_set_security_permission_nwk_cp0_s
{
  uint16_t attr_handle;
  uint8_t security_permissions;
} aci_gatt_srv_set_security_permission_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_set_security_permission_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_set_security_permission_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_read_handle_value_nwk_cp0_s
{
  uint16_t attr_handle;
  uint16_t offset;
  uint16_t value_length_requested;
} aci_gatt_srv_read_handle_value_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_read_handle_value_nwk_rp0_s
{
  uint8_t status;
  uint16_t length;
  uint16_t value_length;
  uint8_t value[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} aci_gatt_srv_read_handle_value_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_set_access_permission_nwk_cp0_s
{
  uint16_t attr_handle;
  uint8_t access_permissions;
} aci_gatt_srv_set_access_permission_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_set_access_permission_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_set_access_permission_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_notify_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint8_t flags;
  uint16_t val_length;
  uint8_t val[(HCI_MAX_PAYLOAD_SIZE - 7) / sizeof(uint8_t)];
} aci_gatt_srv_notify_cp0;

typedef PACKED(struct) aci_gatt_srv_notify_rp0_s
{
  uint8_t status;
} aci_gatt_srv_notify_rp0;

typedef PACKED(struct) aci_gatt_srv_exec_write_resp_nwk_cp0_s
{
  uint16_t conn_handle;
  uint8_t exec;
} aci_gatt_srv_exec_write_resp_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_exec_write_resp_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_exec_write_resp_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_authorize_resp_nwk_cp0_s
{
  uint16_t conn_handle;
  uint16_t attr_handle;
  uint8_t operation_type;
  uint8_t error_code;
  uint16_t attr_val_offset;
  uint16_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 10) / sizeof(uint8_t)];
} aci_gatt_srv_authorize_resp_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_authorize_resp_nwk_rp0_s
{
  uint8_t status;
} aci_gatt_srv_authorize_resp_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_read_prepare_queue_nwk_cp0_s
{
  uint16_t conn_handle;
  uint8_t item_index;
} aci_gatt_srv_read_prepare_queue_nwk_cp0;

