zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) aci_gatt_srv_read_prepare_queue_nwk_rp0_s
{
  uint8_t status;
  uint16_t attr_handle;
  uint16_t value_offset;
  uint16_t value_length;
  uint8_t value[(HCI_MAX_PAYLOAD_SIZE - 7) / sizeof(uint8_t)];
} aci_gatt_srv_read_prepare_queue_nwk_rp0;

typedef PACKED(struct) aci_gatt_srv_write_multiple_instance_handle_value_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t value_length;
  uint8_t value[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_srv_write_multiple_instance_handle_value_cp0;

typedef PACKED(struct) aci_gatt_srv_write_multiple_instance_handle_value_rp0_s
{
  uint8_t status;
} aci_gatt_srv_write_multiple_instance_handle_value_rp0;

typedef PACKED(struct) aci_gatt_srv_read_multiple_instance_handle_value_nwk_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
} aci_gatt_srv_read_multiple_instance_handle_value_nwk_cp0;

typedef PACKED(struct) aci_gatt_srv_read_multiple_instance_handle_value_nwk_rp0_s
{
  uint8_t status;
  uint16_t value_length;
  uint8_t value[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(uint8_t)];
} aci_gatt_srv_read_multiple_instance_handle_value_nwk_rp0;

typedef PACKED(struct) aci_l2cap_connection_parameter_update_req_cp0_s
{
  uint16_t connection_handle;
  uint16_t conn_interval_min;
  uint16_t conn_interval_max;
  uint16_t slave_latency;
  uint16_t timeout_multiplier;
} aci_l2cap_connection_parameter_update_req_cp0;

typedef PACKED(struct) aci_l2cap_connection_parameter_update_req_rp0_s
{
  uint8_t status;
} aci_l2cap_connection_parameter_update_req_rp0;

typedef PACKED(struct) aci_l2cap_connection_parameter_update_resp_cp0_s
{
  uint16_t connection_handle;
  uint16_t conn_interval_min;
  uint16_t conn_interval_max;
  uint16_t slave_latency;
  uint16_t timeout_multiplier;
  uint16_t minimum_ce_length;
  uint16_t maximum_ce_length;
  uint8_t identifier;
  uint8_t accept;
} aci_l2cap_connection_parameter_update_resp_cp0;

typedef PACKED(struct) aci_l2cap_connection_parameter_update_resp_rp0_s
{
  uint8_t status;
} aci_l2cap_connection_parameter_update_resp_rp0;

typedef PACKED(struct) aci_l2cap_cfc_connection_req_nwk_cp0_s
{
  uint16_t connection_handle;
  uint16_t spsm;
  uint16_t cid;
  uint16_t mtu;
  uint16_t mps;
  uint8_t cfc_policy;
} aci_l2cap_cfc_connection_req_nwk_cp0;

typedef PACKED(struct) aci_l2cap_cfc_connection_req_nwk_rp0_s
{
  uint8_t status;
} aci_l2cap_cfc_connection_req_nwk_rp0;

typedef PACKED(struct) aci_l2cap_cfc_connection_resp_nwk_cp0_s
{
  uint16_t connection_handle;
  uint8_t identifier;
  uint16_t cid;
  uint16_t mtu;
  uint16_t mps;
  uint16_t result;
  uint8_t cfc_policy;
} aci_l2cap_cfc_connection_resp_nwk_cp0;

typedef PACKED(struct) aci_l2cap_cfc_connection_resp_nwk_rp0_s
{
  uint8_t status;
} aci_l2cap_cfc_connection_resp_nwk_rp0;

typedef PACKED(struct) aci_l2cap_send_flow_control_credits_cp0_s
{
  uint16_t connection_handle;
  uint16_t cid;
  uint16_t rx_credits;
  uint8_t cfc_policy;
} aci_l2cap_send_flow_control_credits_cp0;

typedef PACKED(struct) aci_l2cap_send_flow_control_credits_rp0_s
{
  uint8_t status;
  uint16_t rx_credit_balance;
} aci_l2cap_send_flow_control_credits_rp0;

typedef PACKED(struct) aci_l2cap_disconnect_cp0_s
{
  uint16_t connection_handle;
  uint16_t cid;
} aci_l2cap_disconnect_cp0;

typedef PACKED(struct) aci_l2cap_disconnect_rp0_s
{
  uint8_t status;
} aci_l2cap_disconnect_rp0;

typedef PACKED(struct) aci_l2cap_transmit_sdu_data_nwk_cp0_s
{
  uint16_t connection_handle;
  uint16_t cid;
  uint16_t sdu_length;
  uint8_t sdu_data[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_l2cap_transmit_sdu_data_nwk_cp0;

typedef PACKED(struct) aci_l2cap_transmit_sdu_data_nwk_rp0_s
{
  uint8_t status;
} aci_l2cap_transmit_sdu_data_nwk_rp0;

typedef PACKED(struct) aci_test_tx_notification_start_cp0_s
{
  uint16_t connection_handle;
  uint16_t service_handle;
  uint16_t char_handle;
  uint16_t value_length;
} aci_test_tx_notification_start_cp0;

typedef PACKED(struct) aci_test_tx_notification_start_rp0_s
{
  uint8_t status;
} aci_test_tx_notification_start_rp0;

typedef PACKED(struct) aci_test_tx_write_command_start_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t value_length;
} aci_test_tx_write_command_start_cp0;

typedef PACKED(struct) aci_test_tx_write_command_start_rp0_s
{
  uint8_t status;
} aci_test_tx_write_command_start_rp0;

typedef PACKED(struct) aci_test_rx_start_cp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint8_t notifications_write_cmds;
} aci_test_rx_start_cp0;

typedef PACKED(struct) aci_test_rx_start_rp0_s
{
  uint8_t status;
} aci_test_rx_start_rp0;

typedef PACKED(struct) aci_test_stop_cp0_s
{
  uint8_t tx_rx;
} aci_test_stop_cp0;

typedef PACKED(struct) aci_test_stop_rp0_s
{
  uint8_t status;
} aci_test_stop_rp0;

typedef PACKED(struct) aci_test_report_rp0_s
{
  uint8_t status;
  uint32_t tx_packets;
  uint32_t rx_packets;
  uint16_t rx_data_length;
  uint32_t rx_sequence_errors;
} aci_test_report_rp0;

typedef PACKED(struct) hci_disconnection_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t reason;
} hci_disconnection_complete_event_rp0;

typedef PACKED(struct) hci_encryption_change_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t encryption_enabled;
} hci_encryption_change_event_rp0;

typedef PACKED(struct) hci_read_remote_version_information_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t version;
  uint16_t manufacturer_name;
  uint16_t subversion;
} hci_read_remote_version_information_complete_event_rp0;

typedef PACKED(struct) hci_hardware_error_event_rp0_s
{
  uint8_t hardware_code;
} hci_hardware_error_event_rp0;

typedef PACKED(struct) hci_number_of_completed_packets_event_rp0_s
{
  uint8_t number_of_handles;
  packed_handle_packets_pair_entry_t handle_packets_pair_entry[(HCI_MAX_PAYLOAD_SIZE - 1) /
                                                               sizeof(packed_handle_packets_pair_entry_t)];
} hci_number_of_completed_packets_event_rp0;

typedef PACKED(struct) hci_data_buffer_overflow_event_rp0_s
{
  uint8_t link_type;
} hci_data_buffer_overflow_event_rp0;

typedef PACKED(struct) hci_encryption_key_refresh_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_encryption_key_refresh_complete_event_rp0;

