zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) hci_authenticated_payload_timeout_expired_event_rp0_s
{
  uint16_t connection_handle;
} hci_authenticated_payload_timeout_expired_event_rp0;

typedef PACKED(struct) aci_blue_initialized_event_rp0_s
{
  uint8_t reason_code;
} aci_blue_initialized_event_rp0;

typedef PACKED(struct) aci_blue_events_lost_event_rp0_s
{
  uint8_t lost_events[8];
} aci_blue_events_lost_event_rp0;

typedef PACKED(struct) aci_blue_crash_info_event_rp0_s
{
  uint8_t crash_type;
  uint32_t sp;
  uint32_t r0;
  uint32_t r1;
  uint32_t r2;
  uint32_t r3;
  uint32_t r12;
  uint32_t lr;
  uint32_t pc;
  uint32_t x_psr;
  uint8_t debug_data_length;
  uint8_t debug_data[(HCI_MAX_PAYLOAD_SIZE - 38) / sizeof(uint8_t)];
} aci_blue_crash_info_event_rp0;

typedef PACKED(struct) aci_hal_end_of_radio_activity_event_rp0_s
{
  uint8_t last_state;
  uint8_t next_state;
  uint32_t next_state_sys_time;
} aci_hal_end_of_radio_activity_event_rp0;

typedef PACKED(struct) aci_hal_scan_req_report_event_rp0_s
{
  int8_t rssi;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
} aci_hal_scan_req_report_event_rp0;

typedef PACKED(struct) aci_hal_fw_error_event_rp0_s
{
  uint8_t fw_error_type;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 2) / sizeof(uint8_t)];
} aci_hal_fw_error_event_rp0;

typedef PACKED(struct) aci_hal_le_test_end_event_rp0_s
{
  uint16_t number_of_packets;
} aci_hal_le_test_end_event_rp0;

typedef PACKED(struct) aci_gap_pairing_complete_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t status;
  uint8_t reason;
} aci_gap_pairing_complete_event_rp0;

typedef PACKED(struct) aci_gap_pass_key_req_event_rp0_s
{
  uint16_t connection_handle;
} aci_gap_pass_key_req_event_rp0;

typedef PACKED(struct) aci_gap_proc_complete_event_rp0_s
{
  uint8_t procedure_code;
  uint8_t status;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(uint8_t)];
} aci_gap_proc_complete_event_rp0;

typedef PACKED(struct) aci_gap_addr_not_resolved_event_rp0_s
{
  uint16_t connection_handle;
} aci_gap_addr_not_resolved_event_rp0;

typedef PACKED(struct) aci_gap_numeric_comparison_value_event_rp0_s
{
  uint16_t connection_handle;
  uint32_t numeric_value;
} aci_gap_numeric_comparison_value_event_rp0;

typedef PACKED(struct) aci_gap_keypress_notification_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t notification_type;
} aci_gap_keypress_notification_event_rp0;

typedef PACKED(struct) aci_l2cap_connection_update_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t result;
} aci_l2cap_connection_update_resp_event_rp0;

typedef PACKED(struct) aci_l2cap_proc_timeout_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 3) / sizeof(uint8_t)];
} aci_l2cap_proc_timeout_event_rp0;

typedef PACKED(struct) aci_l2cap_connection_update_req_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t identifier;
  uint16_t l2_cap_length;
  uint16_t interval_min;
  uint16_t interval_max;
  uint16_t slave_latency;
  uint16_t timeout_multiplier;
} aci_l2cap_connection_update_req_event_rp0;

typedef PACKED(struct) aci_l2cap_cfc_connection_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t event_type;
  uint16_t result;
  uint8_t identifier;
  uint16_t spsm;
  uint16_t cid;
  uint16_t remote_cid;
  uint16_t peer_mtu;
  uint16_t peer_mps;
  uint16_t initial_credits;
} aci_l2cap_cfc_connection_event_rp0;

typedef PACKED(struct) aci_l2cap_disconnection_complete_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t cid;
} aci_l2cap_disconnection_complete_event_rp0;

typedef PACKED(struct) aci_l2cap_flow_control_credit_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t cid;
  uint16_t tx_credits;
  uint16_t tx_credit_balance;
} aci_l2cap_flow_control_credit_event_rp0;

typedef PACKED(struct) aci_l2cap_sdu_data_tx_nwk_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t cid;
  uint16_t sdu_length;
  uint16_t tx_credit_balance;
} aci_l2cap_sdu_data_tx_nwk_event_rp0;

typedef PACKED(struct) aci_l2cap_sdu_data_rx_nwk_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t cid;
  uint16_t rx_credit_balance;
  uint16_t sdu_length;
  uint8_t sdu_data[(HCI_MAX_PAYLOAD_SIZE - 8) / sizeof(uint8_t)];
} aci_l2cap_sdu_data_rx_nwk_event_rp0;

typedef PACKED(struct) aci_l2cap_command_reject_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t identifier;
  uint16_t reason;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_l2cap_command_reject_event_rp0;

typedef PACKED(struct) aci_gatt_srv_attribute_modified_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t attr_handle;
  uint16_t attr_data_length;
  uint8_t attr_data[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_srv_attribute_modified_event_rp0;

typedef PACKED(struct) aci_gatt_proc_timeout_event_rp0_s
{
  uint16_t connection_handle;
} aci_gatt_proc_timeout_event_rp0;

typedef PACKED(struct) aci_att_exchange_mtu_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t server_rx_mtu;
} aci_att_exchange_mtu_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_find_info_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t format;
  uint16_t event_data_length;
  uint8_t handle_uuid_pair[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} aci_att_clt_find_info_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_find_by_type_value_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t num_of_handle_pair;
  packed_attribute_group_handle_pair_t attr_group_handle_pair[(HCI_MAX_PAYLOAD_SIZE - 3) /
                                                              sizeof(packed_attribute_group_handle_pair_t)];
} aci_att_clt_find_by_type_value_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_read_by_type_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t handle_value_pair_length;
  uint16_t data_length;
  uint8_t handle_value_pair_data[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} aci_att_clt_read_by_type_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_read_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t event_data_length;
  uint8_t attribute_value[(HCI_MAX_PAYLOAD_SIZE - 4) / sizeof(uint8_t)];
} aci_att_clt_read_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_read_blob_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t event_data_length;
  uint8_t attribute_value[(HCI_MAX_PAYLOAD_SIZE - 4) / sizeof(uint8_t)];
} aci_att_clt_read_blob_resp_event_rp0;

