zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) aci_att_clt_read_multiple_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t event_data_length;
  uint8_t set_of_values[(HCI_MAX_PAYLOAD_SIZE - 4) / sizeof(uint8_t)];
} aci_att_clt_read_multiple_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_read_by_group_type_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t Attribute_Data_Length;
  uint16_t data_length;
  uint8_t attribute_data_list[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} aci_att_clt_read_by_group_type_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_prepare_write_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t attribute_handle;
  uint16_t offset;
  uint16_t part_attribute_value_length;
  uint8_t part_attribute_value[(HCI_MAX_PAYLOAD_SIZE - 8) / sizeof(uint8_t)];
} aci_att_clt_prepare_write_resp_event_rp0;

typedef PACKED(struct) aci_att_clt_exec_write_resp_event_rp0_s
{
  uint16_t connection_handle;
} aci_att_clt_exec_write_resp_event_rp0;

typedef PACKED(struct) aci_gatt_clt_indication_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t attribute_handle;
  uint16_t attribute_value_length;
  uint8_t attribute_value[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_clt_indication_event_rp0;

typedef PACKED(struct) aci_gatt_clt_notification_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t attribute_handle;
  uint16_t attribute_value_length;
  uint8_t attribute_value[(HCI_MAX_PAYLOAD_SIZE - 6) / sizeof(uint8_t)];
} aci_gatt_clt_notification_event_rp0;

typedef PACKED(struct) aci_gatt_clt_proc_complete_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t error_code;
} aci_gatt_clt_proc_complete_event_rp0;

typedef PACKED(struct) aci_gatt_clt_error_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t req_op_code;
  uint16_t attribute_handle;
  uint8_t error_code;
} aci_gatt_clt_error_resp_event_rp0;

typedef PACKED(struct) aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t attribute_handle;
  uint8_t attribute_value_length;
  uint8_t attribute_value[(HCI_MAX_PAYLOAD_SIZE - 5) / sizeof(uint8_t)];
} aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0;

typedef PACKED(struct) aci_gatt_tx_pool_available_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t available_buffers;
} aci_gatt_tx_pool_available_event_rp0;

typedef PACKED(struct) aci_gatt_srv_confirmation_event_rp0_s
{
  uint16_t connection_handle;
} aci_gatt_srv_confirmation_event_rp0;

typedef PACKED(struct) aci_att_srv_exec_write_req_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t flags;
} aci_att_srv_exec_write_req_event_rp0;

typedef PACKED(struct) aci_gatt_srv_authorize_nwk_event_rp0_s
{
  uint16_t conn_handle;
  uint16_t attr_handle;
  uint8_t operation_type;
  uint16_t attr_val_offset;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 8) / sizeof(uint8_t)];
} aci_gatt_srv_authorize_nwk_event_rp0;

typedef PACKED(struct) hci_le_connection_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t role;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
  uint16_t conn_interval;
  uint16_t conn_latency;
  uint16_t supervision_timeout;
  uint8_t master_clock_accuracy;
} hci_le_connection_complete_event_rp0;

typedef PACKED(struct) hci_le_advertising_report_event_rp0_s
{
  uint8_t num_reports;
  packed_advertising_report_t advertising_report[(HCI_MAX_PAYLOAD_SIZE - 1) / sizeof(packed_advertising_report_t)];
} hci_le_advertising_report_event_rp0;

typedef PACKED(struct) hci_le_connection_update_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint16_t conn_interval;
  uint16_t conn_latency;
  uint16_t supervision_timeout;
} hci_le_connection_update_complete_event_rp0;

typedef PACKED(struct) hci_le_read_remote_used_features_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t le_features[8];
} hci_le_read_remote_used_features_complete_event_rp0;

typedef PACKED(struct) hci_le_long_term_key_request_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t random_number[8];
  uint16_t encrypted_diversifier;
} hci_le_long_term_key_request_event_rp0;

typedef PACKED(struct) hci_le_data_length_change_event_rp0_s
{
  uint16_t connection_handle;
  uint16_t max_tx_octets;
  uint16_t max_tx_time;
  uint16_t max_rx_octets;
  uint16_t max_rx_time;
} hci_le_data_length_change_event_rp0;

typedef PACKED(struct) hci_le_read_local_p256_public_key_complete_event_rp0_s
{
  uint8_t status;
  uint8_t local_p256_public_key[64];
} hci_le_read_local_p256_public_key_complete_event_rp0;

typedef PACKED(struct) hci_le_generate_dhkey_complete_event_rp0_s
{
  uint8_t status;
  uint8_t dh_key[32];
} hci_le_generate_dhkey_complete_event_rp0;

typedef PACKED(struct) hci_le_enhanced_connection_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t role;
  uint8_t peer_address_type;
  uint8_t peer_address[6];
  uint8_t local_resolvable_private_address[6];
  uint8_t peer_resolvable_private_address[6];
  uint16_t conn_interval;
  uint16_t conn_latency;
  uint16_t supervision_timeout;
  uint8_t master_clock_accuracy;
} hci_le_enhanced_connection_complete_event_rp0;

typedef PACKED(struct) hci_le_direct_advertising_report_event_rp0_s
{
  uint8_t num_reports;
  packed_direct_advertising_report_t direct_advertising_report[(HCI_MAX_PAYLOAD_SIZE - 1) /
                                                               sizeof(packed_direct_advertising_report_t)];
} hci_le_direct_advertising_report_event_rp0;

typedef PACKED(struct) hci_le_phy_update_complete_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t tx_phy;
  uint8_t rx_phy;
} hci_le_phy_update_complete_event_rp0;

typedef PACKED(struct) hci_le_extended_advertising_report_event_rp0_s
{
  uint8_t num_reports;
  packed_extended_advertising_report_t extended_adv_report[(HCI_MAX_PAYLOAD_SIZE - 1) /
                                                           sizeof(packed_extended_advertising_report_t)];
} hci_le_extended_advertising_report_event_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_sync_established_event_rp0_s
{
  uint8_t status;
  uint16_t sync_handle;
  uint8_t advertising_sid;
  uint8_t advertiser_address_type;
  uint8_t advertising_address[6];
  uint8_t advertiser_phy;
  uint16_t periodic_advertising_interval;
  uint8_t advertiser_clock_accuracy;
} hci_le_periodic_advertising_sync_established_event_rp0;

