zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_types.h
typedef PACKED(struct) hci_le_periodic_advertising_report_event_rp0_s
{
  uint16_t sync_handle;
  int8_t tx_power;
  int8_t rssi;
  uint8_t cte_type;
  uint8_t data_status;
  uint8_t data_length;
  uint8_t data[(HCI_MAX_PAYLOAD_SIZE - 7) / sizeof(uint8_t)];
} hci_le_periodic_advertising_report_event_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_sync_lost_event_rp0_s
{
  uint16_t sync_handle;
} hci_le_periodic_advertising_sync_lost_event_rp0;

typedef PACKED(struct) hci_le_advertising_set_terminated_event_rp0_s
{
  uint8_t status;
  uint8_t advertising_handle;
  uint16_t connection_handle;
  uint8_t num_completed_extended_advertising_events;
} hci_le_advertising_set_terminated_event_rp0;

typedef PACKED(struct) hci_le_scan_request_received_event_rp0_s
{
  uint8_t advertising_handle;
  uint8_t scanner_address_type;
  uint8_t scanner_address[6];
} hci_le_scan_request_received_event_rp0;

typedef PACKED(struct) hci_le_channel_selection_algorithm_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t channel_selection_algorithm;
} hci_le_channel_selection_algorithm_event_rp0;

typedef PACKED(struct) hci_le_connectionless_iq_report_event_rp0_s
{
  uint16_t sync_handle;
  uint8_t channel_index;
  int16_t rssi;
  uint8_t rssi_antenna_id;
  uint8_t cte_type;
  uint8_t slot_durations;
  uint8_t packet_status;
  uint16_t periodic_event_counter;
  uint8_t sample_count;
  packed_samples_t Samples[(HCI_MAX_PAYLOAD_SIZE - 12) / sizeof(packed_samples_t)];
} hci_le_connectionless_iq_report_event_rp0;

typedef PACKED(struct) hci_le_connection_iq_report_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t rx_phy;
  uint8_t data_channel_index;
  int16_t rssi;
  uint8_t rssi_antenna_id;
  uint8_t cte_type;
  uint8_t slot_durations;
  uint8_t packet_status;
  uint16_t connection_event_counter;
  uint8_t sample_count;
  packed_samples_t Samples[(HCI_MAX_PAYLOAD_SIZE - 13) / sizeof(packed_samples_t)];
} hci_le_connection_iq_report_event_rp0;

typedef PACKED(struct) hci_le_cte_request_failed_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
} hci_le_cte_request_failed_event_rp0;

typedef PACKED(struct) hci_le_periodic_advertising_sync_transfer_received_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint16_t service_data;
  uint16_t sync_handle;
  uint8_t advertising_sid;
  uint8_t advertiser_address_type;
  uint8_t advertising_address[6];
  uint8_t advertiser_phy;
  uint16_t periodic_advertising_interval;
  uint8_t advertiser_clock_accuracy;
} hci_le_periodic_advertising_sync_transfer_received_event_rp0;

typedef PACKED(struct) hci_le_path_loss_threshold_event_rp0_s
{
  uint16_t connection_handle;
  uint8_t current_path_loss;
  uint8_t zone_entered;
} hci_le_path_loss_threshold_event_rp0;

typedef PACKED(struct) hci_le_transmit_power_reporting_event_rp0_s
{
  uint8_t status;
  uint16_t connection_handle;
  uint8_t reason;
  uint8_t phy;
  int8_t transmit_power_level;
  uint8_t Transmit_Power_Level_Flag;
  int8_t delta;
} hci_le_transmit_power_reporting_event_rp0;

#ifdef __cplusplus
}
#endif

#endif /* _STM32WB07_06_TYPES_H_ */
